{"S05E02": {"name": "When It Rains, It Pours", "tvdb_id": 334153, "overview": "Liz uses her newfound confidence to solve Pete's problem with a difficult editor (Paul Giamatti); Jack tries to cheat mortality; Tracy vows to be present when his wife gives birth."}, "S05E16": {"name": "TGS Hates Women", "tvdb_id": 334161, "overview": "Liz hires a new female writer after a blog declares \"TGS\" misogynistic. Meanwhile, Jack plots his takeover of Kabletown by zeroing in on his main competition--the CEO's granddaughter."}, "S07E07": {"name": "Mazel Tov, Dummies!", "tvdb_id": 334205, "overview": "After an encounter with Dennis Duffy, Liz and Criss decide to take drastic measures to start a family. As Liz looks toward the future, Jack and Jenna evaluate their own self-worth, and Tracy laments a shocking medical diagnosis."}, "S07E12": {"name": "Hogcock!", "tvdb_id": 334211, "overview": "Liz has trouble adjusting to being a stay-at-home mother. Jack takes stock of his life, and Tracy struggles to get on without Kenneth."}, "S07E06": {"name": "Aunt Phatso vs. Jack Donaghy", "tvdb_id": 334204, "overview": "Tracy and Jack engage in a battle of wits after Tracy depicts Jack as a villain in his latest project. On Jack's advice, Liz puts her own needs ahead of those of \"TGS.\" Meanwhile, Jenna tries to shield Kenneth from Hazel's manipulation but her own selfishness gets in the way."}, "S05E17": {"name": "Queen of Jordan", "tvdb_id": 334163, "overview": "Angie's reality show visits \"TGS\", resulting in a red-faced situation for Jack, Jenna pining for attention, and Liz leading a scheme to lure Tracy back from Africa. Meanwhile, Frank reconnects with a lost love."}, "S05E03": {"name": "Let's Stay Together", "tvdb_id": 334155, "overview": "Jack must appear before Congress to discuss NBC's merger with KableTown. He hopes that he will charm celebrity members, but one Congresswoman, Regina Bookman, demands more diversity in its programming lineup. Jack quickly enlists Tracy to come up with some new development ideas. Meanwhile, Liz is fed up with the flack her writing staff gives her, and Jenna helps Kenneth reapply to the extremely competitive Page Program."}, "S05E15": {"name": "It's Never Too Late for Now", "tvdb_id": 334170, "overview": "Jenna tries to help a lovelorn Liz rebound from a broken relationship. Elsewhere, sleep deprivation impacts new father Jack, who begins to lose his business savvy and negotiating prowess; and Pete and Frank form a rock band."}, "S05E01": {"name": "The Fabian Strategy", "tvdb_id": 334152, "overview": "Jack begins to meddle in Liz's new relationship with Carol."}, "S02E08": {"name": "Secrets and Lies", "tvdb_id": 334100, "overview": "C.C. and Jack face a block in their relationship when C.C. decides to go public about the affair but Jack refuses. Meanwhile, Liz struggles to keep both Tracy and Jenna happy when the two find it hard to share the spotlight, while Frank makes fun of Toofer's Harvard education with bizarre results."}, "S07E10": {"name": "Florida", "tvdb_id": 334206, "overview": "When Jack persuades Liz to go to Florida with him, they make a shocking discovery about his mother. Jenna and Tracy assume responsibility for the show in Liz's absence, resulting in disaster for Kenneth."}, "S07E04": {"name": "Unwindulax", "tvdb_id": 334202, "overview": "Liz and Jack find themselves battling to influence voters in the upcoming presidential election. Meanwhile, as Jenna goes to great lengths to please her new fan base, the writers seek out new ways to mess with her."}, "S07E05": {"name": "There's No I in America", "tvdb_id": 334203, "overview": "Realizing that Jenna could decide the Presidential election, Liz and Jack stage a debate to win her support and her followers. Kenneth turns to Tracy for advice on how to be an informed voter, while Pete tries to recreate the magic of the 2008 election."}, "S07E11": {"name": "A Goon's Deed in a Weary World", "tvdb_id": 334210, "overview": "As her new kids arrive, Liz scrambles to save TGS from cancellation. Jack finds a new NBC president."}, "S02E09": {"name": "Ludachristmas", "tvdb_id": 334101, "overview": "Jack gets attached to Liz's nurturing parents because they provide the love and support he never got from his mom. The staffers get ready for their raunchy holiday party, but Kenneth changes their plans at the last minute."}, "S05E14": {"name": "Double-Edged Sword", "tvdb_id": 334169, "overview": "Jack and a very pregnant Avery take a romantic break in Canada. When Avery goes into labor, the power couple desperately scramble to not give birth to a Canadian. Meanwhile, Liz's getaway with Carol gets grounded, literally, when their plane collects dust on the tarmac. And Tracy is an EGOT winner, but with that comes overwhelming demands."}, "S05E10": {"name": "Christmas Attack Zone", "tvdb_id": 334162, "overview": "Liz and Avery try to persuade Jack to disclose two secrets he's been hiding from his mother, who visits for the holidays. Then, Liz tries to repair Jenna's relationship with Paul; and Tracy tries to block his film's release because it undermines his newly invented serious persona."}, "S05E04": {"name": "Live Show", "tvdb_id": 334154, "overview": "On show night, Liz Lemon grows increasingly infuriated when no one seems to remember that it's her 40th birthday. Just before the taping, Tracy Jordan becomes convinced that nothing is funnier than a performer laughing and breaking character, which he elects to do all night, much to Jenna Maroney's chagrin. Meanwhile, Jack Donaghy struggles with the consequences of his promise to give up drinking while Avery is pregnant.\n\nThe episode was filmed twice.  The East Coast version aired for the Eastern, Central and Mountain time zones.   The West Coast version was aired in the western, Alaskan and Hawaiian time zones."}, "S07E01": {"name": "The Beginning of the End", "tvdb_id": 334199, "overview": "The \"TGS\" gang returning from hiatus, only to be shocked by Jack's awful fall programming lineup. Meanwhile, bridezilla Jenna taps Liz to be her maid of honor, and Tracy is invited to a dinner party by Kenneth and Hazel."}, "S05E05": {"name": "Reaganing", "tvdb_id": 334156, "overview": "Jack's determined to save Liz's relationship with Carol and Tracy shoots a commercial."}, "S05E11": {"name": "Mrs. Donaghy", "tvdb_id": 334160, "overview": "Budget cuts at the company impact the \"TGS\" gang. Elsewhere, Liz's New Year's resolution adds a potential snarl to Jack's wedding; Jenna and Danny share a dressing room; and a health scare hits Tracy."}, "S05E07": {"name": "Brooklyn Without Limits", "tvdb_id": 334165, "overview": "Jack rocks the vote, manipulating a congressional election to help a particular candidate, thereby leveraging advantage for the network. Meanwhile, a perfect pair of new jeans gives Liz confidence; Tracy organizes a Golden Globe event with Jenna's help."}, "S05E13": {"name": "¡Qué Sorpresa!", "tvdb_id": 334167, "overview": "As Jack tries to cozy up to the owner of Kabletown, Liz fakes being pregnant to help Avery gain advantage over a competitive colleague. Elsewhere, Tracy and Jenna clash when trying to share a gift from their new bosses."}, "S07E02": {"name": "Governor Dunston", "tvdb_id": 334200, "overview": "Jack and Liz find themselves at odds over political satire at \"TGS\". Criss and Liz make a surprising relationship breakthrough. Meanwhile, Jenna, discouraged by the disappointing sales of her summer dance hit, is thrilled to learn that Kenneth's mother and her boyfriend still buy music."}, "S07E03": {"name": "Stride of Pride", "tvdb_id": 334201, "overview": "Liz works to prove to Tracy that women are funny while simultaneously attempting to head off a meltdown from Jenna after some negative publicity. Jack tries out an unconventional dating strategy."}, "S05E12": {"name": "Operation Righteous Cowboy Lightning", "tvdb_id": 334159, "overview": "A reality TV series trails Tracy, which Liz tries to exploit for her own gain. Jack does his own exploiting: He attempts to make a fast buck off natural-disaster telethons. And Lutz sets out to increase his worth in the event of an apocalypse."}, "S05E06": {"name": "Gentleman's Intermission", "tvdb_id": 334164, "overview": "Avery Jessup becomes suspicious of the relationship her fiancé Jack Donaghy has with his employee and friend Liz Lemon, so she orders Jack to set boundaries in their friendship. This proves a problem for Liz when her father, Dick Lemon arrives in town on a break from his marriage. Meanwhile, actor Tracy Jordan is upset when he discovers that his pre-recorded NBC obituary shows him to have done nothing worthwhile in his life, whilst Jenna Maroney learns of the video obituaries, she decides to make a video of her own."}, "S01E05": {"name": "Jack-Tor", "tvdb_id": 334076, "overview": "After being pressured by Jack to plug GE products into her show, Liz integrates Jack into a sketch. While Jack hones his questionable acting chops, Frank and Toofer trick Jenna into fearing for her job and Liz wonders if Tracy is faking illiteracy to skip out on rehearsals."}, "S01E11": {"name": "The Head and the Hair", "tvdb_id": 334082, "overview": "Liz and Jenna work on their dating game when they're beguiled by two very different MSNBC staffers: a brainy geek and a brawny hunk, but cerebral Liz finds it strange that she's more interested in the attractive one. Meanwhile, Kenneth and Jack switch roles."}, "S06E18": {"name": "Murphy Brown Lied to Us", "tvdb_id": 334194, "overview": "Jack sets Liz up on a blind date to show her what she's missing in her relationship with Criss. Meanwhile at KableTown, Jack has to scramble when his plan to manufacture couches hits a speed bump. With Tracy's help, Jenna orchestrates a public meltdown to get Paul's attention."}, "S04E21": {"name": "Emanuelle Goes to Dinosaur Land", "tvdb_id": 334150, "overview": "Jack becomes even more entangled in his love triangle between Avery Jessup and Nancy Donovan, and he turns for advice to Liz, who is focusing on her own romantic problems. When Liz can't find a date to Floyd's wedding, she revisits her old boyfriends in hope that a spark will reignite. Meanwhile, Tracy continues his journey to earn his egot."}, "S04E09": {"name": "Klaus and Greta", "tvdb_id": 334138, "overview": "Following a wild New Year's Eve, Jack has to try to repair the damage he did after leaving a drunken message on an ex's voicemail. Meanwhile, Jenna tries to get into a relationship with James Franco in order to cover up his secret; and Liz, after accidentally \"outing\" her cousin to his family, welcomes him to New York City; and Tracy finds new respect for women."}, "S03E14": {"name": "The Funcooker", "tvdb_id": 334121, "overview": "30 Rock is left in shambles by the cast and crew after Liz is called away for jury duty. Meanwhile, Jack fails to listen to everyone when he becomes obsessed with launching a new big-money product."}, "S03E15": {"name": "The Bubble", "tvdb_id": 334122, "overview": "Liz gives attention to her building relationship with Drew, and discovers that he has been granted special treatment in life due to his pleasing appearance. Meanwhile, Jack goes all out to re-sign Tracy now that his contract has expired. And Jenna's latest ploy to attract attention is to change her hairstyle."}, "S03E01": {"name": "Do-Over", "tvdb_id": 334108, "overview": "Worried that Liz's hectic lifestyle may be too much to adopt a child, Bev, the adoption agent, visits the set. Panicked, Liz tells everyone to act normal, but chaos soon ensues as a fight arises between Jenna and Tracy. Meanwhile, Jack returns to 30 Rock and vows to do whatever it takes to get his position back from Devin."}, "S04E08": {"name": "Secret Santa", "tvdb_id": 334137, "overview": "Jack’s interest in a new social networking site unexpectedly reconnects him with a high school crush. Kenneth tries to organize a Secret Santa Fun Swap, but not without resistance from some of the staff members. Meanwhile, Liz battles the task of buying a gift that’s good enough for Jack, and Jenna is horrified at the prospect of sharing her annual Christmas solo."}, "S04E20": {"name": "The Moms", "tvdb_id": 334149, "overview": "Liz Lemon meets her mother's old flame, while Jack Donaghy's mother, Colleen, gets tangled in his relationships with Avery Jessup and high school love, Nancy Donovan. Jenna's mother, Verna returns, while Tracy learns a lesson from his \"mom\"."}, "S01E10": {"name": "The Rural Juror", "tvdb_id": 334081, "overview": "Jenna anticipates the opening of her independent movie “The Rural Juror”, but the title proves to be a mighty tongue twister for the gang. Meanwhile, cash-challenged Tracy endorses his own celebrity product in an effort to get out of debt."}, "S06E19": {"name": "Live from Studio 6H", "tvdb_id": 334195, "overview": "Kabletown chooses to stop funding live shows for TGS. While Liz and Jack embrace the change, Kenneth argues that live format should be kept intact, and he tries to convince the TGS staff to fight for their right to be live by taking them and our audience through a magical look back at the illustrious history of Studio 6H.\n\nThe episode was filmed twice. The East Coast version aired for the Eastern, Central and Mountain time zones. The West Coast version was aired in the western, Alaskan and Hawaiian time zones."}, "S01E04": {"name": "Jack the Writer", "tvdb_id": 334075, "overview": "Liz struggles to keep Jack out of the writers' room and Kenneth soon learns that working for Tracy may be more than he expected."}, "S01E12": {"name": "Black Tie", "tvdb_id": 334083, "overview": "Liz wonders if she's actually on a date with Jack as she accompanies him to a birthday celebration for a foreign prince. While at the ball, Liz sees a different side to Jack as he unexpectedly runs in to his ex-wife. Back at 30 Rock, Tracy tempts Pete with a booze- and babe-filled party in the office, while Kenneth tries to keep Pete on the straight and narrow."}, "S01E06": {"name": "Jack Meets Dennis", "tvdb_id": 334077, "overview": "After Liz takes her ex-boyfriend, Dennis, back simply because he asks, Jack takes it upon himself to mentor her as he thinks that she is leading a life of mediocrity. Meanwhile, Tracy gets a tattoo in the face, Jenna gets botox and collagen injections, and Josh is given two black eyes by an angry Liz Taylor."}, "S04E22": {"name": "I Do Do", "tvdb_id": 334151, "overview": "Liz questions fate when she meets the man of her dreams, while Jack's love triangle between high school love, Nancy Donovan, and CNBC anchor, Avery Jessup, comes to a head. Meanwhile, Jenna's boyfriend is confronted with a similar dilemma when his desire for another woman threatens to ruin their relationship, and Kenneth, with the help of Tracy, tries to avoid a promotion that would land him in LA."}, "S03E17": {"name": "Cutbacks", "tvdb_id": 334124, "overview": "Despite the 50th episode of TGS airing, everyone is preoccupied with news of budget cuts. Jack has to dole out cutbacks while Kenneth has to take on extra duties. Meanwhile, Liz tries to save her staff and crew and Jenna and Tracy try to uncover Kenneth's secret."}, "S03E03": {"name": "The One with the Cast of Night Court", "tvdb_id": 334110, "overview": "Liz and Jenna are randomly visited by Claire Harper, a free-spirited, Fatal Attraction-like stalker. Claire first targets Jack and claims him for her own. Kenneth, distressed and disappointed by the new page uniforms, looks to be cheered up by Tracy. To make Kenneth smile again, Tracy gives him a surprise which involves the cast of 'Night Court'."}, "S03E02": {"name": "Believe in the Stars", "tvdb_id": 334109, "overview": "Liz heads to Chicago to get out of jury duty and on her flight back to New York she is assigned a seat next to Oprah. Liz seizes the opportunity to ask Oprah for advice with some of the problems she's been having. Back in New York, the feud continues between Tracy and Jenna, and Jack's morals are tested by Kenneth after an Olympics snafu."}, "S03E16": {"name": "Apollo, Apollo", "tvdb_id": 334123, "overview": "While Jack puts together the perfect 50th birthday party for himself, home videos inspire him to try to recreate his happiest moment. Dennis decides to tell Liz about his addiction. Meanwhile, Kenneth and Pete work to make Tracy's childhood dream come true."}, "S01E07": {"name": "Tracy Does Conan", "tvdb_id": 334078, "overview": "Jack bumps Jenna's scheduled appearance on 'Late Night with Conan O'Brien' by booking new star Tracy. Jenna, still irate over watching the show change to \"TGS with Tracy Jordan,\" lashes out at Liz. To make matters worse, Tracy's gone off his medication and he's about to go on national television."}, "S01E13": {"name": "Up All Night", "tvdb_id": 334084, "overview": "It's Valentine's Day, and the TGS crew is celebrating by pulling an all nighter to put together a new episode. While Pete completely forgets the holiday, Kenneth and Cerie may be starting an office romance. Meanwhile, Liz wonders if Dennis is back in her life after she receives flowers from a secret admirer and newly divorced Jack wants to party with Tracy, who for once wants to spend a night alone with his wife instead."}, "S01E17": {"name": "The Fighting Irish", "tvdb_id": 334088, "overview": "Jack helps his brother Eddie land a job at 'TGS', Liz is forced to make desperate staff cutbacks, and Tracy seeks spiritual fulfillment with help from Kenneth."}, "S01E03": {"name": "Blind Date", "tvdb_id": 334074, "overview": "Jack sets Liz up on a blind date with his friend, Thomas. While Liz is busy preparing for the date, Jack infiltrates the writers' weekly poker game."}, "S06E22": {"name": "What Will Happen to the Gang Next Year?", "tvdb_id": 334198, "overview": "Determined to prove his marriage has survived Avery's kidnapping unscathed, Jack asks Liz to officiate their vow renewal. Meanwhile, Criss (Marsden) tries to convince Liz that he's worth sticking around for. Tracy meets with Cornel West to discuss his influence as a black celebrity."}, "S03E12": {"name": "Larry King", "tvdb_id": 334119, "overview": "Jack wonders if his career will get in the way of taking his relationship with Elisa to the next level. Tracy does an interview with Larry King and causes mayhem throughout New York City. Liz loses her cell phone in a cab and brings Kenneth with her out to Queens to retrieve it."}, "S03E06": {"name": "Christmas Special", "tvdb_id": 334113, "overview": "As Christmas nears, Liz's parents ditch her for a couples-only retreat, leaving her all alone for the holiday. Because of this, Liz decides to work for a charity program, \"Letters to Santa.\" Meanwhile, Jack takes his frustration out on the staff after his dream holiday is ruined."}, "S03E07": {"name": "Señor Macho Solo", "tvdb_id": 334114, "overview": "Amid a health scare that sees him growing close to his mother's nurse, Jack helps Tracy and his wife Angie develop a \"post-nup\" and gets Jenna an audition to play Janis Joplin. Jenna thinks Liz is only attracted to a little person because she wants a child."}, "S03E13": {"name": "Goodbye, My Friend", "tvdb_id": 334120, "overview": "Liz befriends a pregnant teenager from a donut shop she visits in the hopes to adopt her baby. Kenneth plans a combined birthday party for Tracy and Jenna, but Jenna wants all of the attention and a party of her own. Jack agrees to go out and party with Frank to keep his mind off of his absent girlfriend and ends up bonding with him over their parental issues."}, "S01E02": {"name": "The Aftermath", "tvdb_id": 334073, "overview": "Now that major changes have occurred on the The Girlie Show, Liz struggles to bring everyone and everything together. However, despite his erratic behavior, Tracy manages to bring everything to order."}, "S01E16": {"name": "The Source Awards", "tvdb_id": 334087, "overview": "Jack forces Tracy to attend the Source Awards and Kenneth has words with a rap artist. Meanwhile, Liz goes to great lengths to prove to her African-American date that she's not racist."}, "S06E09": {"name": "Leap Day", "tvdb_id": 334186, "overview": "Jack learns to appreciate Leap Day while Tracy takes the writers to a restaurant to spend an almost-expired gift card. Liz helps Jenna seduce an internet billionaire."}, "S01E14": {"name": "The C Word", "tvdb_id": 334085, "overview": "As shocked as she is to be called the c-word by Lutz, Liz is more horrified to realize he may be right. Meanwhile, Jack brings Tracy to a charity golf event to get closer to the chairman, however his plan backfires when Tracy acts too much like his uncensored self."}, "S06E21": {"name": "The Return of Avery Jessup", "tvdb_id": 334196, "overview": "Avery finally returns home from her kidnapping ordeal in North Korea, yet Jack grows uncertain of her fidelity while she was away. Elsewhere, Criss is crossed due to Liz's role as top wage earner, and Jenna seeks a sponsor for her approaching nuptials."}, "S03E05": {"name": "Reunion", "tvdb_id": 334112, "overview": "Jack manages to convince a reluctant Liz to attend her high school reunion. Meanwhile, Don Geiss awakens from his coma and shocks Jack with a declaration of who he wants to be the CEO of GE. A shaken Jack decides he needs to get away and blow off some steam, but tags along with Liz to her reunion instead due to bad weather."}, "S03E11": {"name": "St. Valentine's Day", "tvdb_id": 334118, "overview": "Liz insists that she and Drew have their first official date on Valentine's Day. Elisa brings Jack to church to celebrate the day, which is very different from the way he traditionally celebrates. Kenneth employs the help of Tracy to try to win the affection of a new worker."}, "S04E18": {"name": "Khonani", "tvdb_id": 334148, "overview": "Liz discovers that the TGS staff have been excluding her from their weekly hangouts, and strives to prove that she can be fun. Jack must choose between janitors and the shift time they both want, and Kenneth aids Tracy Jordan in being a good husband."}, "S03E10": {"name": "Generalissimo", "tvdb_id": 334117, "overview": "Liz tries to begin a relationship with a new tenant after accidentally receiving his mail. Meanwhile, Jack's appearance causes Elisa's grandmother to disapprove of the relationship, and Tracy has trouble maintaining the lifestyles of Wall Street frat boys."}, "S04E19": {"name": "Argus", "tvdb_id": 334147, "overview": "Wedding fever hits TGS, leaving Liz to sort out Grizz's dilemma when both Tracy and Dot Com want to be his best man. Jenna's new boyfriend, Paul, raises Liz and Pete's suspicions, while Jack is finally forced to deal with the death of his mentor, Don Geiss, when Geiss leaves him a strange but meaningful inheritance."}, "S03E04": {"name": "Gavin Volure", "tvdb_id": 334111, "overview": "Jack and Liz make a visit to a colorful businessman named Gavin Volure, who has a confidential business proposal...and has fallen in love with Liz. Meanwhile, Tracy is afraid that his kids may have figured out an evil plot against him."}, "S06E20": {"name": "Queen of Jordan II: Mystery of the Phantom Pooper", "tvdb_id": 334197, "overview": "Angie brings \"Queen of Jordan'' back to TGS. News about Avery forces Jack to confront his feelings for her mother, and Liz finds herself in a feud."}, "S01E15": {"name": "Hard Ball", "tvdb_id": 334086, "overview": "Jack sees an opportunity for budget cuts when Josh's contract is up, forcing Liz to go out of her way to motivate Josh into staying with TGS and not moving on to a rival show. Meanwhile, Kenneth earns a coveted spot in Tracy's entourage and Jenna gets in trouble over a misquote in Maxim."}, "S01E01": {"name": "Pilot", "tvdb_id": 334072, "overview": "Liz Lemon is the head writer on a demanding, live TV program in New York City. However, things begin to get complicated when her new boss insists that a wild and unpredictable movie star joins the cast."}, "S06E08": {"name": "The Tuxedo Begins", "tvdb_id": 334183, "overview": "Fed up with New York City after being mugged, Jack sets out to protect the safety of the city's elite by announcing his run for mayor. Meanwhile, Liz revels in sacrificing the good of the city to look out for her own interests, and Jenna and Paul are thrilled by the perversion of acting like a normal couple."}, "S06E11": {"name": "Standards and Practices", "tvdb_id": 334189, "overview": "Jenna hatches a surprising new plan to get publicity, while Jack finds himself begrudgingly playing parent to his teenage nemesis, Kaylie Hooper. Liz rejects the new authority Kenneth has over “TGS” with his new job in Standards."}, "S01E18": {"name": "Fireworks", "tvdb_id": 334089, "overview": "Jack and Kenneth work together when Jack discovers that another NBC executive is after his job. Meanwhile, Pete and Liz adjust to life as roommates and Tracy receives paternity papers."}, "S06E05": {"name": "Today You Are a Man", "tvdb_id": 1026575, "overview": "Liz finds a secret weapon to help in her contract negotiations with Jack, Kenneth leaves his job because he feels under-appreciated, and Tracy and Jenna perform at their accountant's ungrateful son's Bar Mitzvah."}, "S04E14": {"name": "Future Husband", "tvdb_id": 334143, "overview": "Liz searches for a man she met in her dentist's waiting room. Jack fears for the future when he learns a cable company may have its sights on NBC. Jenna helps Tracy try to get a Tony award."}, "S03E09": {"name": "Retreat to Move Forward", "tvdb_id": 334116, "overview": "Jack nervously coaxes Liz into joining him at a corporate retreat. Meanwhile, Jenna employs method acting techniques in preparing for her role as Janis Joplin, with Frank's help. And Kenneth wants to prove to Tracy that diet impacts diabetes."}, "S03E21": {"name": "Mamma Mia", "tvdb_id": 334128, "overview": "Liz and Tracy encourage Jack to search for his real father. Tracy meets his new found illegitimate son, but Liz and Pete question the son's intentions. Jenna takes the credit for one of Liz's ideas."}, "S03E20": {"name": "The Natural Order", "tvdb_id": 334127, "overview": "When Liz reprimands Tracy in front of the TGS staff, Tracy asks Liz to stop giving him preferential treatment. Liz agrees, but Tracy thinks that Liz should give up some of her privileges also. Jack remembers some unpleasant memories of his father after his mother, Colleen, visits. Jenna adopts a pet gibbon."}, "S04E01": {"name": "Season 4", "tvdb_id": 334130, "overview": "Jack demands changes to make TGS both more relatable to average Americans and more cost-conscious and sends Liz and Pete to search for fresh blood. Kenneth organizes a strike by the pages."}, "S03E08": {"name": "Flu Shot", "tvdb_id": 334115, "overview": "Flu is spreading amongst the \"TGS\" cast and crew fast, and Liz is determined not to catch it too. Dr. Spaceman is giving vaccinations, but Jack is being selective about who gets one. Liz is offered one, but refuses to accept it, championing the rights of the crew. Meanwhile, Jack must be creative if he is to spend any time with Elisa, since she is working seven days a week."}, "S04E15": {"name": "Don Geiss, America and Hope", "tvdb_id": 334144, "overview": "Jack needs to reestablish himself within the new corporate structure. Liz and Wesley continually run into each other, making them consider fate's role in their lives. Tracy's nanny writes an exposé."}, "S06E04": {"name": "The Ballad of Kenneth Parcell", "tvdb_id": 334180, "overview": "Liz looks for a new best friend after discovering that Jenna has traded their friendship for fame. Tracy contemplates mortality as Dotcom and Grizz scramble to show him that life is still worth living. Meanwhile, Jack decides to end the page program in order to impress Hank Hooper."}, "S06E10": {"name": "Alexis Goodlooking and the Case of the Missing Whisky", "tvdb_id": 334185, "overview": "In order to hide his relationship with Lynn, Frank convinces his mother that he is dating Liz. Tracy and Jenna team up to try to solve the case of Pete's missing whisky. Meanwhile, Jack teaches Kenneth how to take down his first business nemesis."}, "S01E19": {"name": "Corporate Crush", "tvdb_id": 334090, "overview": "The tables have turned inside 30 Rock: Liz is actually happy in her new relationship with Floyd while Jack finds his job may be in jeopardy after his televised fireworks fiasco prompts top GE man Don Geiss to warn he's got his eye on Jack's performance. Tracy vies for Geiss' attention, hoping to turn his feature film idea for Jefferson into a reality."}, "S06E06": {"name": "Hey, Baby, What's Wrong? (1)", "tvdb_id": 334184, "overview": "Criss and Liz decide to celebrate Valentine's Day, but they need to buy a dining room table first. Jack entertains his mother-in-law, Diana, as Jenna frantically looks to Pete to fill in last-minute as the producer of her first live performance on \"America's Kidz Got Singing.\" Back at the office, Tracy and Frank try to help Lutz find someone to spend Valentine's with."}, "S06E12": {"name": "St. Patrick's Day", "tvdb_id": 334187, "overview": "Jack feels unworthy of his latest award and attempts to redeem himself by taking on the writers in a strategic board game. Liz believes she's cursed on St. Patrick's Day when her ex-boyfriend Dennis shows up to derail her relationship with Criss. Meanwhile, Hazel struggles to keep the peace between Tracy and Jenna."}, "S04E03": {"name": "Stone Mountain", "tvdb_id": 334132, "overview": "Jack and Liz search for new talent as they travel to Kenneth's hometown. Jenna makes an attempt to become friends with the writers. Tracy fears he may die next after a pair of celebrities pass away."}, "S04E17": {"name": "Lee Marvin vs. Derek Jeter", "tvdb_id": 334146, "overview": "Liz Lemon starts making an effort to date by attending singles events with Jenna Maroney, and Jack Donaghy feels forced to choose between childhood love, Nancy Donovan and news anchor Avery Jessup. Meanwhile, a racist comment sparks an office-wide debate on affirmative action and leaves Toofer with a big decision to make regarding his future at TGS."}, "S03E22": {"name": "Kidney Now!", "tvdb_id": 334129, "overview": "Jack's biological father's health hangs in the balance as the pair start to build a relationship. Liz draws some attention as a relationship expert, despite her own many failed relationships, after an appearance on a talk show. Tracy is invited to speak at his old high school and Kenneth helps him overcome some embarrassing memories from those years."}, "S04E16": {"name": "Floyd", "tvdb_id": 334145, "overview": "Liz reevaluates her feelings for an old flame, Floyd, when he returns with big news, and Jack Donaghy teaches Danny Baker the finer points of pranks after the TGS writers play a trick on him. Jenna Maroney and Tracy Jordan see Kenneth Parcell in a disturbing new light after they spend a very long day listening to him tell stories about his childhood."}, "S04E02": {"name": "Into the Crevasse", "tvdb_id": 334131, "overview": "Jack tries to protect his job and the company when Devin returns to seek revenge; Tracy and Jenna try to make Liz's life miserable; Kenneth volunteers at an animal shelter."}, "S06E13": {"name": "Grandmentor", "tvdb_id": 334188, "overview": "Liz struggles in her new role as mentor to Hazel. Kenneth has a difficult time letting go of his page duties and takes drastic measures to make sure Tracy is taken care of. Meanwhile, Jack and Jenna come up with a plan to get Avery back in the headlines."}, "S06E03": {"name": "Idiots Are People Three!", "tvdb_id": 334181, "overview": "Tracy Jordan challenges Liz by leading his own protest in defense of idiots everywhere. Jack faces off with Devin Banks yet again, but still finds time to interfere with Liz's relationship by giving Criss an ultimatum, and Liz tries to get rid of Jenna's new assistant."}, "S06E17": {"name": "Meet the Woggels!", "tvdb_id": 334193, "overview": "Jack's mom upstages his ribbon-cutting ceremony. Meanwhile Jenna hooks up with a \"rock star\" and Tracy frets about his son heading to college."}, "S04E06": {"name": "Sun Tea", "tvdb_id": 334135, "overview": "When Liz's apartment building is converted to condos she has to make a drastic change to her living arrangements. Meanwhile, Jack and Tracy reevaluate their plans for parenthood and Kenneth is on a mission to make \"TGS\" greener during NBC's annual \"Green Week.\""}, "S04E12": {"name": "Verna", "tvdb_id": 334141, "overview": "Jenna's mother comes to visit, and she looks to Jack to help. Frank moves in with Liz as a boarder, and they decide to aid one another stop some bad habits."}, "S04E13": {"name": "Anna Howard Shaw Day", "tvdb_id": 334142, "overview": "Liz schedules a root canal to avoid feeling lonely on Valentine's Day; Jack woos an attractive and successful TV host; Jenna's stalker loses interest."}, "S04E07": {"name": "Dealbreakers Talk Show #0001", "tvdb_id": 334136, "overview": "The tables are turned when production begins on Liz’s new talk show, “Dealbreakers,” and she experiences what its like to walk a mile in Jenna’s  shoes. Jack, dealing with pressure from Devin, calculates to make “Dealbreakers” a success. Meanwhile, Tracy takes on the ultimate Hollywood challenge in order to prove his commitment to his wife. Everyone pitches in to help Tracy reach his goal including Kenneth, Dotcom  and Grizz."}, "S06E16": {"name": "Nothing Left to Lose", "tvdb_id": 334192, "overview": "Tracy regains his sense of smell and finds an unusual father figure in Liz, while the writers spark a prank war with Jenna."}, "S06E02": {"name": "Idiots Are People Two!", "tvdb_id": 334179, "overview": "An offensive rant by Tracy is leaked online. Jack disapproves of Liz's new boyfriend, and the Best Friends Gang is reunited when Kenneth and Jenna call for the help of Kelsey Grammer."}, "S01E21": {"name": "Hiatus", "tvdb_id": 334092, "overview": "As TGS' summer hiatus approaches, Liz deals with the difficulties of her long-distance relationship with Floyd while she enlists Kenneth's help in locating on-the-lam Tracy. Meanwhile, Jack's impending marriage to Phoebe brings his mother, Colleen Donaghy to town."}, "S06E14": {"name": "Kidnapped by Danger", "tvdb_id": 334190, "overview": "Liz's scripted version of Jack and Avery's love story leaves Jack confused and frustrated by his feelings for Diana. Meanwhile, Jenna and Tracy attempt to beat Weird Al Yankovic at his own game, and Kenneth gets an unexpected new job at NBC."}, "S01E09": {"name": "The Baby Show", "tvdb_id": 334080, "overview": "When ditzy receptionist Cerie spreads news of her engagement to a filthy rich Greek heir, Liz confronts her own marital and maternal status. Meanwhile, emotionally hardened Jack softens due to \"mommy issues.\""}, "S04E11": {"name": "Winter Madness", "tvdb_id": 334140, "overview": "Hoping to boost staffers' spirits, Liz takes TGS on the road, but Jack takes over for his own reasons, and the staff find reasons to blame Liz for all that's wrong in their lives."}, "S03E18": {"name": "Jackie Jormp-Jomp", "tvdb_id": 334125, "overview": "During her short-term suspension, Liz is lost without TGS and the stress that comes with her job. Jack works with Jenna so she can use her celebrity status to generate some promotional buzz for her Janis Joplin bio-film."}, "S04E05": {"name": "The Problem Solvers", "tvdb_id": 334134, "overview": "The crew awaits the arrival of the new cast member. Tracy and Jenna rethink how they treat Kenneth. Jack offers Liz a talk show."}, "S04E04": {"name": "Audition Day", "tvdb_id": 334133, "overview": "Liz and Pete try to rig the audition process; Tracy and Jenna decide they should conduct their own search for the next 'TGS' star."}, "S04E10": {"name": "Black Light Attack!", "tvdb_id": 334139, "overview": "Jack tries to squash the burgeoning relationship between Liz and Danny. Tracy asks Sue to be in his entourage. Jenna tries out for Gossip Girl."}, "S03E19": {"name": "The Ones", "tvdb_id": 334126, "overview": "Jack goes shopping for an engagement ring, for Elisa, with Liz. Elisa tells Liz a secret, and a prank results in an injury back at TGS."}, "S06E01": {"name": "Dance Like Nobody's Watching", "tvdb_id": 334178, "overview": "Tracy becomes frustrated in his attempts to anger Liz. Jack questions the family value of the network's new talent competition and Kenneth awaits the Rapture."}, "S01E08": {"name": "The Break-Up", "tvdb_id": 334079, "overview": "When Liz finally dumps her boyfriend Dennis, she prowls the singles scene under Jenna's tutelage. Love also stinks for Jack, as he discovers dating a Bush administration official has its downside. And Tracy and Toofer clash, which lands both in sensitivity training."}, "S06E15": {"name": "The Shower Principle", "tvdb_id": 334191, "overview": "A curse strikes TGS. Liz dares to be different after realizing that the same things happen every year, and Jack vows to wow Hank Hooper."}, "S01E20": {"name": "Cleveland", "tvdb_id": 334091, "overview": "Sick of New York and frustrated with his career, Floyd contemplates a move to the Midwest and asks Liz if she's consider leaving TGS behind. Jack rushes to Paris (and soon, the altar) with Christie's auctioneer Phoebe while Tracy works furiously on financing his latest career move, dubbed the \"Tracy Jordan Comeback.\""}, "S02E02": {"name": "Jack Gets in the Game", "tvdb_id": 334094, "overview": "When Jack discovers that his boss is retiring, he decides to get in the competition for his position. Meanwhile, Jenna begins to enjoy her fame for being fat and along with Jack encourages Liz to get her act together. Finally, Kenneth makes it his mission to get Tracy and Angie back together."}, "S05E23": {"name": "Respawn", "tvdb_id": 334172, "overview": "The \"TGS\" crew anticipate their summer vacation. Liz lands in the Hamptons for some rest and relaxation, but she gets the summertime blues when Tracy moves in next door. Elsewhere, a lonely Jack latches onto Kenneth for company; and Jenna's new job impacts her relationship with Paul."}, "S05E22": {"name": "Everything Sunny All the Time Always", "tvdb_id": 334171, "overview": "Liz tries to turn her personal life from drab to fab by revamping her dream apartment. Meanwhile, Avery is held hostage, and Tracy discovers that Kenneth, Dot Com and Grizz have forged a solid bond while he was away."}, "S02E03": {"name": "The Collection", "tvdb_id": 334095, "overview": "Jack hires his own private investigator to lead GE in the wrong direction so that they will not be able to find any dirt on him that might put him in a compromising position. However, when he is asked to give up his cookie jar collection, Jack finds the task too much of a challenge. Meanwhile, Angie announces that she will follow Tracy at all times to keep him in line, which Liz believes to be good until she covers for Tracy and gets on Angie's bad side. Finally, Jenna starts to worry once she starts to lose all the weight she gained over the summer and her popularity begins to hang on the line."}, "S02E01": {"name": "Seinfeldvision", "tvdb_id": 334093, "overview": "As the cast and crew of TGS with Tracy Jordan returns for a new season, Liz is excited to see Jack again. However, her excitement quickly fades as Jack insists that Liz is still not over Floyd. Meanwhile, Jerry Seinfeld shows up at Jack's office in an upset mood after Jack announces his newest plan. Finally, Kenneth becomes Tracy's office wife when Tracy separates from his wife and Jenna returns to set a whole lot heavier now that she has been involved in Mystic Pizza: The Musical!."}, "S05E08": {"name": "College", "tvdb_id": 334157, "overview": "Jack worries that GE's microwave sales have improved too much without his help and tries to find glitches in their newest design. Meanwhile, Liz partakes in a crew lottery despite Jenna and Tracy's warning her not to do so. Elsewhere, the TGS writers discover that Jack is the voice of an online dictionary's pronunciation guide."}, "S02E15": {"name": "Cooter", "tvdb_id": 334107, "overview": "In the second season finale, Jack moves on to a new job involving politics in Washington, but the position is not quite what he anticipated. Meanwhile, Liz suffers a pregnancy scare, Kenneth confronts rival page Donny when applying for a summer job, and Tracy works on his latest invention."}, "S05E20": {"name": "100 (1)", "tvdb_id": 334173, "overview": "Chaos builds when bigwig Hank Hooper marks \"TGS\" for cancellation, yet Jack persuades him to let the staffers stage the show's 100th episode."}, "S05E21": {"name": "100 (2)", "tvdb_id": 334174, "overview": "With their show targeted for cancellation, the \"TGS\" crew desperately scramble to mount a top-notch production for their 100th episode. Meanwhile, Jack reconsiders a vital decision in his life, and Jenna mulls over motherhood."}, "S02E14": {"name": "Sandwich Day", "tvdb_id": 334105, "overview": "Floyd stays at Liz's place overnight when his flight is canceled. Meanwhile, Jack is demoted to the 12th floor, causing him to question his future status at the company. Finally, the staff celebrates Annual Sandwich Day with mysterious sandwiches from a secret location in Brooklyn."}, "S05E09": {"name": "Chain Reaction of Mental Anguish", "tvdb_id": 334158, "overview": "Jack recommends that Liz start seeing a therapist when she worries that Carol is getting bored with their relationship. In an attempt to take Jack's advice, Liz begins talking to Kenneth about her problems. Jack also finds himself caught up in one of Tracy's schemes when Tracy tries to convince him to invest in his son's theme restaurant in Times Square. Meanwhile, Jenna and Paul celebrate their six month anniversary."}, "S02E04": {"name": "Rosemary's Baby", "tvdb_id": 334096, "overview": "Liz meets her longtime idol, Rosemary Howard, and invites her to be a guest writer on \"TGS with Tracy Jordan\". However, Rosemary's ideas turn out to be too much for the show, prompting Jack to pressure Liz into firing her. Meanwhile, Jack takes Tracy to a therapist to explain to him why he must do the opposite of what he is told, and Jenna ruins Kenneth's page jacket, causing him to compete in a page-off to keep his job."}, "S02E10": {"name": "Episode 210", "tvdb_id": 334102, "overview": "Jack and C.C. try to make their long distance romance work, Liz decides to invest in real estate, and Kenneth becomes addicted to caffeine."}, "S05E19": {"name": "I Heart Connecticut", "tvdb_id": 334168, "overview": "As cancellation looms for \"TGS\", Liz snoops with Kenneth to find a missing Tracy. Meanwhile, Jack works his magic to ensure the financial success of Jenna's newest endeavor; and an emasculated Pete organizes a manly contest for the writers and crew."}, "S07E08": {"name": "My Whole Life Is Thunder", "tvdb_id": 334207, "overview": "Jenna annoys Liz with her wedding envy, Jack devises a plan to avoid disappointing his visiting mother and Tracy attempts to cheer up Kenneth."}, "S07E09": {"name": "Game Over", "tvdb_id": 334208, "overview": "Jack asks Devin Banks to help him discredit Kaylie Hooper, Jack's teenage nemesis and KableTown's future CEO. Liz considers her options as she tries to become a mother. Tracy directs Octavia Spencer in his movie."}, "S02E11": {"name": "MILF Island", "tvdb_id": 334103, "overview": "When someone on the 'TGS with Tracy Jordan' staff insults Jack in a newspaper article about the season finale of 'MILF Island', he frantically sends Jonathan to interrogate everyone on 'TGS' until the culprit is found."}, "S05E18": {"name": "Plan B", "tvdb_id": 334166, "overview": "\"TGS\" is forced into hiatus, spurring the show's staffers to seek backup jobs. Meanwhile, Jack tries to rescue a cable network by forging an unlikely alliance with his archenemy, Devin Banks."}, "S02E05": {"name": "Greenzo", "tvdb_id": 334097, "overview": "It's time for Kenneth's annual house party, but he may be the only one excited about it. The soiree has only been attended by Liz in the past, so in order to get a better turnout Tracy spreads rumors that ultimately get out of hand.  Meanwhile, Jack deals with NBC's new environmentally-friendly mascot, whose new-found stardom goes to his head."}, "S02E13": {"name": "Succession", "tvdb_id": 334106, "overview": "When Don decides to promote Jack and make him his successor over Devon, Jack decides to give his old job to Liz because she always has his back. However, a turn of events concerning Don's health compromises Jack's promotion. Meanwhile, Tracy thinks that his son is embarrassed of his career because he did not invite him to fathers day at school."}, "S02E07": {"name": "Cougars", "tvdb_id": 334099, "overview": "As part of his community service, Tracy must coach a little league team. All goes well until Jack takes interest in the team and turmoil starts from there. Meanwhile, Liz is asked out on a date by Jamie, the new coffee boy, who thinks Liz is actually younger than she truly is."}, "S02E06": {"name": "Somebody to Love", "tvdb_id": 334098, "overview": "Jack falls for a congresswoman he meets at a cocktail party and despite the fact that they hold opposite views, the couple agrees to put politics aside and have a secret affair. Meanwhile, Liz believes her Middle Eastern neighbor to be a terrorist and tips off Homeland Security, creating a big mess."}, "S02E12": {"name": "Subway Hero", "tvdb_id": 334104, "overview": "Dennis becomes a New York City celebrity after jumping in front of a train and saving someone who fell on the tracks. Meanwhile, Jack desperately tries to persuade Tracy to become the celebrity face of the Republican Party."}}