{"S02E23": {"name": "Virgins", "tvdb_id": 64942, "overview": "In a series of flashbacks, Jess, Nick, Schmidt, Winston and Cece tell one another how they each lost their virginity. Not surprisingly, when they realize the stories directly affect their present day sex lives, one relationship will change forever."}, "S05E02": {"name": "What About Fred", "tvdb_id": 1155103, "overview": "Jumping back into the dating pool, Jess finds herself dating a dud (guest star Taran Killam), but falls in love with his perfect parents (guest stars Henry Winkler and Julie Haggerty). Meanwhile, Nick (Jake Johnson) and Schmidt have very different ideas about how to run the bar."}, "S05E16": {"name": "Helmet", "tvdb_id": 1186055, "overview": "Despite being happy with Sam, Jess confesses to Cece that she had a sex dream about Nick. And Schmidt attempts to help Winston land Furguson a cat audition when he finds out Aly's boyfriend is a talent agent for pets."}, "S07E07": {"name": "The Curse of the Pirate Bride", "tvdb_id": 1480967, "overview": "Jess and Nick make two life-changing decisions and Winston and Aly's big day arrives."}, "S07E06": {"name": "Mario", "tvdb_id": 1467632, "overview": "Nick's plan to propose to Jess is thrown off-course when they decide to get a dog, Winston sees color for the first time and Schmidt worries about Cece getting pregnant again."}, "S05E17": {"name": "Road Trip", "tvdb_id": 1186056, "overview": "After being emasculated in front of Cece, Schmidt insists on a manly bachelor party weekend in Vegas, but the road trip goes awry when the guys end up at a desert biker bar and he must put his newfound bravado to the test."}, "S05E03": {"name": "Jury Duty", "tvdb_id": 1155104, "overview": "Jess eagerly reports to jury duty, until she discovers she may be up for a work promotion. Meanwhile, Nick reaches his limit with Cece's messiness in the loft."}, "S02E22": {"name": "Bachelorette Party", "tvdb_id": 64941, "overview": "Jess decides to throw Cece a surprise bachelorette party while Nick and Winston awkwardly take her fiancé, Shivrang, out for the night. Then, as Schmidt desperately tries to find a real girlfriend in time for the wedding in order to get a “plus one,” he is forced to seek out his old girlfriend from his “fat Schmidt” college days."}, "S02E20": {"name": "Chicago", "tvdb_id": 64940, "overview": "When a death occurs in Nick's family, Jess, Schmidt and Winston travel with Nick to the Windy City to help him with the funeral preparations and meet his boisterous family members, including his mom, Bonnie; his younger brother, Jamie; and his Boston cousin, Bobby."}, "S05E15": {"name": "Jeff Day", "tvdb_id": 1186054, "overview": "Jess invents a male alter ego, \"Jeff Day,\" in order to buy a new car from a sexist salesman, but her plan backfires when both Nick and Sam arrive at the dealership pretending to be him. Meanwhile, Schmidt and Cece panic when Winston decides to bring his new prankster girlfriend, Rhonda as his plus one to their wedding."}, "S05E01": {"name": "Big Mama P", "tvdb_id": 1140355, "overview": "When Cece and Schmidt ask Jess and Nick to be their Maid of Honor and Best Man, respectively, their first task is to plan the engagement party. But when Jess invites Cece's mom to join in the celebration, Cece is forced to make a surprising announcement to Schmidt."}, "S02E08": {"name": "Parents", "tvdb_id": 64927, "overview": "Jess invites her divorced Mom and Dad over for Thanksgiving dinner and enlists Nick and Cece to help her with a \"Parent Trap\" to reunite them. Meanwhile, Schmidt's cousin, Big Schmidt, visits, and Winston manipulates them into an escalating battle to prove their manhood."}, "S07E04": {"name": "Where the Road Goes", "tvdb_id": 1467630, "overview": "The gang gathers for a one-year memorial service for a beloved friend. Meanwhile, Jess discovers Coach owes Nick a large sum of money."}, "S07E05": {"name": "Godparents", "tvdb_id": 1467631, "overview": "Jess tries to appease Winston's anxiety about his impending fatherhood by tracking down his long lost dad. Meanwhile, Schmidt goes back to work for the first time since Ruth's birth."}, "S02E09": {"name": "Eggs", "tvdb_id": 64928, "overview": "When Jess learns that a friend is pregnant, both she and Cece panic that time is running out for them to have children. Meanwhile, Schmidt seeks advice on how to please Emma, and Nick and Winston visit the zoo to find inspiration for Nick's zombie-themed novel."}, "S05E14": {"name": "300 Feet", "tvdb_id": 1185757, "overview": "When Jess is served a restraining order by her ex-boyfriend, Sam, she sets out to clear her name with Winstons help. Nick and Schmidt plot against the owner of a trendy new bar that opened on their street."}, "S02E21": {"name": "First Date", "tvdb_id": 64939, "overview": "Jess and Nick, who are caught between friendship and something more, try to break out of relationship-limbo by going on a First Date. Once Schmidt and Winston realize a full-on Jess/Nick romance might be happening, they swoop in to try to sabotage the date."}, "S05E10": {"name": "Goosebumps Walkaway", "tvdb_id": 1174157, "overview": "Jess attempts to discover the real identity of a juror who was sequestered with her; Reagan prepares to move on; Winston and Cece help Schmidt overcome his fear of public dancing."}, "S02E19": {"name": "Quick Hardening Caulk", "tvdb_id": 64938, "overview": "Jess comes to a conclusion about her romantic feelings for Nick and she struggles to tell him - until she's hopped up on pain medication. But after admitting her feelings, she finds out he may have been keeping something from her. Meanwhile, Schmidt becomes obsessed with buying a fish, which Winston sees as a metaphor for Schmidt's unresolved feelings toward Cece and Nick plans a bar promotion to impress the bar owner (guest star Odette Annable)."}, "S05E04": {"name": "No Girl", "tvdb_id": 1155105, "overview": "With Jess sequestered at jury duty, Nick turns the loft into an airbnb in order to help pay for Schmidt's upcoming bachelor party. Meanwhile, Winston asks Cece for help when he suspects KC is cheating on him."}, "S02E25": {"name": "Elaine's Big Day", "tvdb_id": 64944, "overview": "Cece's wedding day finds Jess and Nick making a decision about their relationship. Meanwhile, Schmidt schemes with a typically overenthusiastic Winston to sabotage the nuptials, although a shocking announcement may be bigger than anything he plans."}, "S07E01": {"name": "About Three Years Later", "tvdb_id": 1365201, "overview": "Jess and Nick come back from a book tour for \"The Pepperwood Chronicles\" across Europe."}, "S02E24": {"name": "Winston's Birthday", "tvdb_id": 64943, "overview": "Jess' dad chooses the worst day to pay the loft an unexpected visit, forcing a nervous Nick to spend the day alone with him. Jess finds herself with huge opportunity for a new job on the day before Cece's wedding. Schmidt must take a look in the mirror and confront his real feelings about Elizabeth. Meanwhile, Winston psyches himself up for his huge surprise birthday celebration, which no one seemed to remember to throw for him."}, "S05E05": {"name": "Bob & Carol & Nick & Schmidt", "tvdb_id": 1155106, "overview": "Nick's cousin and his wife visit with a very special request, which prompts Schmidt to offer Nick a glimpse into the future. Meanwhile, Winston and Cece shop for a wedding dress."}, "S05E11": {"name": "The Apartment", "tvdb_id": 1174158, "overview": "It's time for Cece to move into the loft. While Jess is helping her friend move out of her beloved apartment, she has to finish the school's budget by morning, which the new principal has neglected to tell her. Meanwhile, Winston gets a new partner to avoid having to work side-by-side with Aly."}, "S02E18": {"name": "Tinfinity", "tvdb_id": 64937, "overview": "Jess catches the eye of a professional football player, with whom Winston landed an exclusive interview for his radio station. Meanwhile, Nick and Schmidt argue over the planning of their \"TinFinity\" party celebrating their tenth anniversary of living together, and Cece gets a surprise offer"}, "S05E07": {"name": "Wig", "tvdb_id": 1165693, "overview": "Schmidt and Cece take action when Nick's attraction to Reagan impacts their relationship; Winston teaches Reagan about breakups."}, "S05E13": {"name": "Sam, Again", "tvdb_id": 1174520, "overview": "Jess applies for a job at a progressive new school, but things take a turn when she finds out the principal is dating her ex-boyfriend, Sam. Meanwhile, Nick gets a cold and Schmidt quarantines the roommates to prevent himself from getting sick before his big presentation."}, "S07E02": {"name": "Tuesday Meeting", "tvdb_id": 1465355, "overview": "Over a drunken power lunch, Jess and Cece decide to stand up to Russell and demand Jess be given more responsibility in her new job. Meanwhile, Nick struggles to come up with ideas for a new book and Schmidt is desperate to get Ruth to sleep."}, "S07E03": {"name": "Lillypads", "tvdb_id": 1467629, "overview": "Nervous about Ruth's interview at a prestigious pre-school, Schmidt recruits Jess to help her prepare. Meanwhile, Nick procrastinates writing, and Winston prepares to confront his fear of testifying in court."}, "S05E12": {"name": "D-Day", "tvdb_id": 1174519, "overview": "After Cece receives an exciting new job offer, Jess agrees to help Schmidt with the wedding preparations, but things don’t go as planned when Schmidt’s dad, Gavin, appears. Meanwhile, Winston and Nick get into a competition over whose job is harder."}, "S05E06": {"name": "Reagan", "tvdb_id": 1155107, "overview": "A beautiful pharmaceutical rep enters the gang’s life when she agrees to sublet Jess’ room while she is on jury duty."}, "S01E05": {"name": "Cece Crashes", "tvdb_id": 64902, "overview": "Cece convinces Jess that Nick likes her more than just as a roommate and Schmidt tries to seal the deal with Cece."}, "S01E11": {"name": "Jess and Julia", "tvdb_id": 64906, "overview": "Nick panics when Julia doesn't want to put a label on their relationship. Meanwhile, Jess enlists Julia to help her get out of a traffic ticket, Winston reconnects with a former booty call and Schmidt is baffled as to why his shower towel is always damp."}, "S06E18": {"name": "Young Adult", "tvdb_id": 1266980, "overview": "When Jess worries that she may not be a cool enough principal, she recruits Nick and \"The Pepperwood Chronicles\" to help make her popular with the students. Meanwhile, Schmidt hires an eager and overly-aggressive new assistant and Winston realizes that Furguson may be two-timing him."}, "S04E21": {"name": "Panty Gate", "tvdb_id": 1052280, "overview": "Schmidt takes the fall to help Fawn out of a political scandal. Meanwhile, Jess declares herself a “love doctor” and Coach faces a life-changing decision with May."}, "S04E09": {"name": "Thanksgiving IV", "tvdb_id": 1018200, "overview": "With winter coming and everyone still single, Schmidt initiates a \"Bangs-giving\"-themed Thanksgiving dinner party, to which everyone must bring someone compatible for someone else."}, "S03E14": {"name": "Prince", "tvdb_id": 971022, "overview": "Jess is ready to paint the town purple when a chance encounter finds her and best friend Cece invited to a once-in-a-lifetime mansion party thrown by music legend Prince. Not wanting to miss out on the fun, Nick, Schmidt, Winston and Coach are determined to crash the festivities, building toward an Unforgettable ending."}, "S03E15": {"name": "Exes", "tvdb_id": 971272, "overview": "When Nick has an awkward run-in with his ex, Caroline, Jessica tries to convince him he can still be friends with her, by introducing him to her former boyfriend, Berkley. Meanwhile, Coach uses Schmidt's loft to impress a date, but things turn farcically disastrous when Schmidt arrives home with his own potential bedmate."}, "S03E01": {"name": "All In", "tvdb_id": 64945, "overview": "Nick and Jess make a romantic run for the border -- but their wild Mexican adventure takes a turn for the worse when Nick is arrested."}, "S04E08": {"name": "Teachers", "tvdb_id": 1014407, "overview": "Jess, Coach and Ryan attend a teachers' conference, led by education guru Brenda Brown. Back at the loft, Nick, Schmidt and Winston try to have a wild weekend while Jess is out of town."}, "S04E20": {"name": "Par 5", "tvdb_id": 1048366, "overview": "Fawn takes Jess to a charity golf tournament, but the Vice Principal lands in the sand trap in her attempts to make a good impression. Meanwhile, Winston meets a beautiful woman and must lie about being a cop."}, "S01E10": {"name": "The Story of the 50", "tvdb_id": 64904, "overview": "When Schmidt's plans for his 29th birthday fall apart, Jess takes charge and enlists the help of her school's party hungry vice-principal. Meanwhile, Nick begrudgingly has his first date at Schmidt's party with a beautiful lawyer who harbors a secret, and the gang wonders who placed a 50 dollar bill in the douchebag jar."}, "S06E19": {"name": "Socalyalcon VI", "tvdb_id": 1276215, "overview": "When Reagan returns home from a work trip, Jess is concerned that she has been spending too much time being Nick's \"girlfriend.\" Meanwhile, Schmidt and Cece obsess over security in their new home and Aly reveals an embarrassing secret to Winston."}, "S01E04": {"name": "Naked", "tvdb_id": 64898, "overview": "Jess accidentally walks in on Nick naked, sending his self-confidence to an all-time low - just after an attractive co-worker agrees to go out on a date with him. Meanwhile, Winston becomes obsessed with learning pop-culture references online."}, "S01E12": {"name": "The Landlord", "tvdb_id": 64907, "overview": "Against Nick's wishes, Jess makes it her mission to get the loft's cantankerous landlord to like her. In doing so, she inadvertently jeopardizes their living situation and the guys are forced to admit they've made some \"unofficial\" changes to the apartment. Meanwhile Schmidt tries to decipher what he thinks are mixed signals from his boss Kim."}, "S01E06": {"name": "Thanksgiving", "tvdb_id": 64900, "overview": "Jess invites Paul, a music teacher at her school on whom she always has had a crush, to the gang’s big Thanksgiving dinner at the loft, which naturally goes horribly awry."}, "S04E22": {"name": "Clean Break", "tvdb_id": 1054374, "overview": "As Coach prepares to move out of the loft, Schmidt also decides to get rid of his non-essentials and in the process discovers what is truly important to him; Jess and Nick reminisce about their “sex mug” and wonder if they still have feelings for each other."}, "S03E17": {"name": "Sister II", "tvdb_id": 971982, "overview": "Jess panics when her sister, Abby decides to stay in Los Angeles and sets her eyes on one of the loftmates. Meanwhile, Winston procrastinates about checking his test results for the LAPD entrance exam"}, "S03E03": {"name": "Double Date", "tvdb_id": 64948, "overview": "Thinking Schmidt has chosen to be with Cece, Jess and Nick invite him to go on a double date with them. Nick is caught between loyalty to his friend and loyalty to his girlfriend when he finds out a shocking secret. Meanwhile, Winston promises to get the foursome a table at an ultra-exclusive restaurant that doesn’t take reservations."}, "S03E02": {"name": "Nerd", "tvdb_id": 64949, "overview": "Jess has been hired at a new school and is eager to prove herself as one of the cool teachers."}, "S03E16": {"name": "Sister", "tvdb_id": 971517, "overview": "Jess' wild-child sister, Abby, pays a visit and immediately throws the loft into disarray. Meanwhile, Schmidt enlists Nick to be his wingman in crashing a bar mitzvah and Winston throws a dinner party with Bertie, which turns awkward when only Cece and Coach attend."}, "S01E07": {"name": "Bells", "tvdb_id": 64901, "overview": "Jess gets jealous when Winston joins her troubled-youth handbell quartet and instantly becomes a natural. Meanwhile Nick and Schmidt engage in class warfare when the toilet breaks and they each have their own idea of how to get it fixed."}, "S01E13": {"name": "Valentine's Day", "tvdb_id": 64908, "overview": "Single for the first time on Valentine's Day, Jess convinces Schmidt to be her wingman as she attempts to have an attachment-free fling with a handsome stranger. Nick's romantic plans are foiled when he finds himself spending more time with Julia's law firm assistant than with her. Winston becomes one of the girls when Shelby invites him over on the holiday."}, "S01E17": {"name": "Fancyman (1)", "tvdb_id": 64912, "overview": "Jess reluctantly dates the wealthy father of one of her students. Meanwhile, Nick attempts to buy a new cell phone and Schmidt and Winston get ultra-competitive playing bar trivia."}, "S01E03": {"name": "Wedding", "tvdb_id": 64899, "overview": "The guys are invited to a wedding, and Nick is fearful that he'll run into his ex, so he asks Jess to be his date. Meanwhile, Winston takes his role as usher very seriously, and Schmidt catches the eye of two women."}, "S06E22": {"name": "Five Stars for Beezus", "tvdb_id": 1290023, "overview": "Jess is ready to tell Nick of her true feelings for him. Meanwhile, Nick takes a meeting with a book publisher, as Aly helps Winston reconnect with an important person. Then, Cece and Schmidt receive big news."}, "S03E12": {"name": "Basketsball", "tvdb_id": 970227, "overview": "Jess tries to become good friends with Coach by watching Detroit Pistons games with him and becoming a Pistons \"fan\". However Jess' \"fandom\" starts to interfere with her relationship with Nick, who is a lifelong Chicago Bulls fan. Winston agrees to shadow Schmidt at his marketing job, where Schmidt is later asked to guide Ed (Bob Gunton), a sixty-something intern, to avoid a company lawsuit over age discrimination."}, "S03E06": {"name": "Keaton", "tvdb_id": 64951, "overview": "Schmidt receives a series of recent e-mails from his favorite actor Michael Keaton, who has sent letters to Nick ever since he was a kid. However, it turns out those letters and e-mails were not from the actor but from Schmidt's mother and Nick, posing as Keaton. Cece indulges in nightly parties to get over her break up with Schmidt."}, "S03E07": {"name": "Coach", "tvdb_id": 64946, "overview": "Coach visits the apartment to spend a \"guys night out\" with the guys, after breaking up with his girlfriend. Nick going to a strip club with the guys, and telling her that they haven't had a conversation about whether or not they're boyfriend/girlfriend or are exclusive, upsets Jess to the point that she has \"girls night out\" with Cece at the bar."}, "S03E13": {"name": "Birthday", "tvdb_id": 970735, "overview": "Nick struggles to throw Jess the perfect birthday party, while Schmidt works overtime to help out Cece in her new job as bartender and Winston and Coach engage in a bake-off."}, "S01E02": {"name": "Kryptonite", "tvdb_id": 64896, "overview": "Nick and Schmidt convince Jess to get her stuff out of her ex-boyfriend Spencer's apartment; Jess meets new roommate Winston, who has returned from playing basketball in Latvia. Winston tries to get his old room back from Schmidt."}, "S01E16": {"name": "Control", "tvdb_id": 64911, "overview": "After Jess realizes that Schmidt is unfairly doing all of the housework, she pushes him to \"go on strike,\" and the entire ecosystem of the loft is thrown off balance. Meanwhile, Nick scrambles when he must pay up to Winston after losing a poker game."}, "S06E09": {"name": "Es Good", "tvdb_id": 1241270, "overview": "Schmidt enlists Nick to help him earn the respect of his difficult house contractor. Meanwhile, as Jess and Robby test the limits of their ability to be in a casual relationship, Winston and Cece debate the pros and cons of not being single."}, "S01E14": {"name": "Bully", "tvdb_id": 64910, "overview": "When Jess tries to intervene with a classroom bully she finds herself the target of the bad seed student. Schmidt, meanwhile, is thrilled over his post-Valentine's sexcapades, but hates that his paramour wants to keep it a secret; and Nick goes into a tailspin when Julia sends him a cactus."}, "S06E21": {"name": "San Diego", "tvdb_id": 1286810, "overview": "As Jess continues to stay with her dad in Portland, they unexpectedly help one another with their love lives. Meanwhile, Nick turns to a reluctant Aly for help with his relationship with Reagan, and Schmidt contemplates using his first name."}, "S03E05": {"name": "The Box", "tvdb_id": 64947, "overview": "Nick becomes irresponsible with the money from his late father's estate, so Jess uses some of the money to pay Nick's unpaid bills, behind his back. With Nick's improved financial situation, Winston feels its finally time to ask Nick for the money he owes him."}, "S03E11": {"name": "Clavado En Un Bar", "tvdb_id": 970308, "overview": "When Jess has to make a quick decision about her career, her friends all recall how they ended up at their jobs."}, "S04E18": {"name": "Walk of Shame", "tvdb_id": 1043135, "overview": "After a night of partying at Bearclaw's, Jess and Cece make their way back to the loft and run into a familiar face. Meanwhile, Coach worries about bringing Nick and Winston around his sophisticated new girlfriend, May."}, "S03E10": {"name": "Thanksgiving III", "tvdb_id": 968625, "overview": "Nick and Jess take the gang camping for Thanksgiving; Coach and Schmidt compete to prove who is the best woodsman; Cece and Winston bond over a shared dislike for the outdoors."}, "S04E19": {"name": "The Right Thing", "tvdb_id": 1047145, "overview": "Jess crashes a funeral, hoping to delete a “sext” she recently sent to the deceased. Then, Schmidt’s mom, Louise, arrives in town for a visit to demand he write thank-you notes for his bar mitzvah gifts, and Winston is desperate to be off-duty friends with his police partner, Aly."}, "S03E04": {"name": "The Captain", "tvdb_id": 64950, "overview": "Schmidt sets out to sabotage Jess and Nick's relationship."}, "S06E20": {"name": "Misery", "tvdb_id": 1284714, "overview": "Jess avoids her feelings for Nick by taking care of her dad in Portland. While attending a work party with Reagan, Nick panics that they really don't know each other. Meanwhile, Aly prepares to meet Winston's mom for the first time, as Winston admits he hasn't told her they are cops."}, "S01E15": {"name": "Injured", "tvdb_id": 64909, "overview": "When Nick is hurt playing a game of touch football and Jess discovers he doesn't have insurance, she takes him to her doctor friend -- an OB-GYN. The gang rallies together and Nick evaluates his life when his seemingly innocuous back injury may prove to be more serious than thought."}, "S01E01": {"name": "Pilot", "tvdb_id": 64897, "overview": "After leaving her long-time boyfriend, Jess moves into an apartment with three men, and tries to re-enter the dating world."}, "S06E08": {"name": "James Wonder", "tvdb_id": 1233190, "overview": "In order to land the soon-to-be open principal's position at her school, Jess must impress the disapproving president of the Parents' Council. Winston puts his undercover skills to the test and Nick struggles to come up with the perfect wedding gift for Schmidt and Cece."}, "S06E11": {"name": "Raisin's Back", "tvdb_id": 1246022, "overview": "When Reagan moves into the loft, Nick tries to \"play it cool.\" Meanwhile, Schmidt embarks on a soul-searching journey when Cece and Winston challenge his love of electronic dance music."}, "S01E18": {"name": "Fancyman (2)", "tvdb_id": 64913, "overview": "Jess' sophisticated date with Russell doesn't go as planned. Meanwhile, Nick's college friend visits and brings out Nick's inner frat boy to help him get over his break-up with Julia. Also, Winston panics when Shelby goes on a \"girls\" vacation and Schmidt and Cece try to keep their relationship under the covers, but one of the friends finds out their secret."}, "S06E05": {"name": "Jaipur Aviv", "tvdb_id": 1232350, "overview": "While the gang helps Schmidt &amp; Cece remodel their fixer-upper, Jess spearheads a vote to let Reagan eventually move back into the loft. Meanwhile, Nick and Winston make a revealing discovery and Schmidt and Cece learn the art of compromise."}, "S01E24": {"name": "See Ya", "tvdb_id": 64919, "overview": "When one of the roommates decides to move out of the loft, the gang makes an unexpected trip to the desert where Winston faces his fear of the dark, Cece and Schmidt’s relationship reaches a turning point and Jess and Nick square off with a coyote."}, "S04E14": {"name": "Swuit", "tvdb_id": 1036422, "overview": "Jess helps Schmidt and Nick pitch their new business venture - the \"Swuit,\" a suit made entirely of sweatshirt material - to entrepreneur Lori Greiner. Meanwhile, Winston and Coach decide they will invest in Cece's future."}, "S03E09": {"name": "Longest Night Ever", "tvdb_id": 968154, "overview": "Jess must occupy Schmidt while Cece goes on a date with Coach; Nick and Winston search for Ferguson."}, "S03E21": {"name": "Big News", "tvdb_id": 974225, "overview": "Nick and Jess try to keep their breakup a secret; Winston passes the police academy entrance exam and demands a celebration."}, "S03E20": {"name": "Mars Landing", "tvdb_id": 973271, "overview": "Jess and Nick face some truths about their relationship, while Schmidt, Winston and Coach scramble to make a better second impression on their hot new neighbors. Also, Cece panics after she drunk-texts Buster"}, "S04E01": {"name": "The Last Wedding", "tvdb_id": 1008544, "overview": "At the last wedding of the summer, the gang makes a pact: Each of them will get lucky by night's end. Jess sets her sights on the best man, who also has caught the eye of a beautiful scientist. Meanwhile, Schmidt and Nick get an indecent proposal. Winston recovers from his police academy training, and Coach panics when he realizes he already has hooked up with every woman at the party."}, "S03E08": {"name": "Menus", "tvdb_id": 966303, "overview": "An overabundance of Chinese food take-out menus left at the loft’s front door is the catalyst for an interconnected series of adventures for Jess and the guys."}, "S04E15": {"name": "The Crawl", "tvdb_id": 1038392, "overview": "When a new bar opens in the neighborhood, it completes the final piece of the puzzle for Nick's epic Valentine's Day pub crawl. Meanwhile, Jess and Ryan drunkenly contemplate their future, Coach meets a new woman - over and over again - and Schmidt tries to fit into the world of politics."}, "S06E04": {"name": "Homecoming (II)", "tvdb_id": 1225522, "overview": "Jess and the gang head to New York, where Schmidt believes he is being honored at his high school. Jess meets Det. Jake Peralta and helps him on a case, which leads her to Brooklyn’s 99th Precinct and a fateful encounter with Gina Linetti and Capt. Raymond Holt. Meanwhile, Nick and Winston scramble to make subway fare, while trying to impress Det. Charles Boyle, and Cece faces off with her new mother-in-law.\n\nThe crossover starts on Brooklyn Nine-Nine S04E04 The Night Shift (I)."}, "S06E10": {"name": "Christmas Eve Eve", "tvdb_id": 1241271, "overview": "Jess struggles to keep the loft's Secret Santa gift exchange afloat. When Winston believes his online gift order for Cece won't be delivered in time, he and Schmidt must endure going to an actual store to find a replacement gift. Meanwhile, Reagan surprises Nick, who helps makes Jess' Christmas one to remember."}, "S01E19": {"name": "Secrets", "tvdb_id": 64914, "overview": "While training for a marathon, Jess discovers that Cece has been keeping a secret from her, and their friendship is put to the test. Meanwhile, Winston can't handle being the only one who knows about Cece and Schmidt, and Nick reluctantly asks for Schmidt's help as he tries to juggle dating two women at once."}, "S06E06": {"name": "Ready", "tvdb_id": 1236052, "overview": "After Jess announces that she is ready to date again, Schmidt pushes her to give her workout partner, Robby, a fighting chance. Then, when Cece hires a hunky new bartender, Nick struggles to understand male beauty, while Winston's newfound confidence makes him irresistible."}, "S06E12": {"name": "The Cubicle", "tvdb_id": 1249786, "overview": "When Jess insists on covering Robby's medical bill, she is stunned after finding out the total and goes to extremes to find a way to help pay. With Schmidt and Winston's help, Cece attempts to get her new modeling agency off the ground (and out of the loft), but is discouraged when her first client is inspired to change career paths. Meanwhile, Reagan puts off reading Nick's new novel."}, "S04E03": {"name": "Julie Berkman's Older Sister", "tvdb_id": 1009826, "overview": "Jess' dad arrives with his new girlfriend, who happened to be Jess and Cece's high-school rival. Meanwhile, Schmidt recruits the guys to be part of a focus group at work to help him land a big new account."}, "S04E17": {"name": "Spiderhunt", "tvdb_id": 1041628, "overview": "It’s a lockdown in the loft when Schmidt’s arachnophobia forces the group go on a spider hunt. In the midst of this chaos, Winston inadvertently makes Jess think that Cece is in love with Nick."}, "S03E22": {"name": "Dance", "tvdb_id": 974839, "overview": "Jess fears someone is trying to sabotage her first middle school dance and she enlists the gang to help her chaperone on the big night."}, "S03E23": {"name": "Cruise", "tvdb_id": 975274, "overview": "Jess and Nick invite the gang along with them on a cruise they booked while still together as a couple."}, "S04E16": {"name": "Oregon", "tvdb_id": 1040215, "overview": "Jess takes a bumpy stroll down memory lane when she and the gang travel to her childhood home in Portland, Oregon, for her father's wedding."}, "S04E02": {"name": "Dice", "tvdb_id": 1008545, "overview": "Schmidt tutors Jess in the not-so-fine-art of dating via mobile apps. Meanwhile, Winston is desperate to make a good impression on his fellow police cadets, which backfires when Nick, Coach and Cece show up at a party thrown by fellow officers."}, "S06E13": {"name": "Cece's Boys", "tvdb_id": 1253351, "overview": "As Jess tries to find a new vice principal, she discovers that she has a real problem when it comes to making decisions. Meanwhile, Cece enlists Jess and Reagan to help her recruit new models, and the guys are in for a surprise when they enjoy a day at the spa."}, "S06E07": {"name": "Last Thanksgiving", "tvdb_id": 1236792, "overview": "It's Thanksgiving and Jess and the gang are determined to make this year's festivities a success. However, things don't go according to plan when Robby surprisingly shows up and Schmidt's dad arrives heartbroken. Meanwhile, Nick finds out that Regan is postponing her move-in date and Winston deals with his \"heroic\" injury."}, "S01E22": {"name": "Tomatoes", "tvdb_id": 64917, "overview": "Jess fears she and Russell don't share the fiery passion he exhibits with his ex-wife Ouli. Meanwhile, Cece is not yet willing to admit her true feelings for Schmidt, so she encourages him to go on a date with one of her Russian model roommates. Then, a down-in-the-dumps Nick channels all of his energy into a new vegetable garden."}, "S06E03": {"name": "Single and Sufficient", "tvdb_id": 1223832, "overview": "When Schmidt and Cece and Winston and Aly invite Jess on their couples glamping trip, members of her singles-only group tag along. Meanwhile, Nick struggles with the next chapter of his New Orleans-set novel after Schmidt gives him \"no notes\"."}, "S06E17": {"name": "Rumspringa", "tvdb_id": 1266978, "overview": "When Jess gets nervous about starting her new position as principal, Nick and Schmidt decide to take her on a relaxing day trip to Solvang, which quickly goes \"sideways.\" Meanwhile, with Cece's help, Winston tries to finalize his divorce from Rhonda, but finds that he and Aly are caught in a series of never-ending pranks."}, "S04E06": {"name": "Background Check", "tvdb_id": 1011867, "overview": "As part of Winston's police academy training, the loft must pass a home visit and background check, which shouldn't be a problem until Jess admits she might be hiding illegal substances in her closet."}, "S04E12": {"name": "Shark", "tvdb_id": 1021796, "overview": "Nick and Coach become concerned when they meet Winston's new training officer; Jess uses Schmidt in hope of influencing a councilwoman to stop the night construction taking place outside the loft."}, "S04E13": {"name": "Coming Out", "tvdb_id": 1030987, "overview": "A class trip turns disastrous when Jess tries to avoid showing favoritism to Ryan; Schmidt develops an ulcer; Winston becomes fixated on wearing a crystal."}, "S04E07": {"name": "Goldmine", "tvdb_id": 1012888, "overview": "Nick pretends to be gay to make his status as Jess' \"ex\" less of an issue to her new beau. To Coach's annoyance, Winston works his \"Long Game\" on their attractive neighbors, Michelle and Viv. Meanwhile, Schmidt panics when Cece considers having a breast reduction"}, "S06E16": {"name": "Operation: Bobcat", "tvdb_id": 1260514, "overview": "On Valentine's Day, Jess tries to convince the gang that she is perfectly content being single. Meanwhile, Schmidt competes for a big promotion and Winston's proposal plans to Aly are expedited."}, "S06E02": {"name": "Hubbedy Bubby", "tvdb_id": 1223831, "overview": "Jess and Cece jump on the campaign trail and make a bet with a disbelieving Schmidt that they can recruit voters for the upcoming Presidential election. Meanwhile, Winston teaches Nick about modern phone sex."}, "S01E23": {"name": "Backslide", "tvdb_id": 64918, "overview": "When Jess and Nick run into their exes Paul and Caroline, the gang fears they both may \"backslide\" into romantic relationships. Meanwhile, Schmidt desperately tries not to get aroused as he deals with a delicate medical issue, Winston suffers the consequences of a wild night out with his boss and Cece brings Schmidt to a nursing home to meet her grandmother."}, "S01E21": {"name": "Kids", "tvdb_id": 64916, "overview": "Jess babysits Russell's pre-teen daughter for the weekend and meets his ex-wife. Then, Schmidt and Cece panic when they think she's pregnant. Also, Nick's new girlfriend may be too young and Winston discovers his new boss is a big baby."}, "S06E14": {"name": "The Hike", "tvdb_id": 1253352, "overview": "While on a day hike, Jess and Robby discover something unexpected about their relationship. Also, Winston throws a surprise welcome home party for Aly. Meanwhile, Schmidt and Cece fail to impress their new neighbors."}, "S01E09": {"name": "The 23rd", "tvdb_id": 64905, "overview": "The gang attends Schmidt's holiday office party and Jess frets when she receives an expensive gift from Paul."}, "S04E11": {"name": "LAXmas", "tvdb_id": 1021795, "overview": "As the gang prepares to depart for the holidays, they quickly find they may be home alone when they are all trapped at the airport."}, "S03E18": {"name": "Sister III", "tvdb_id": 972319, "overview": "When Jess moves into Nick’s bedroom, they both must deal with their complete lack of personal space. Meanwhile, Cece worries that Abby is taking advantage of Schmidt, while Coach worries Cece is treating him like one of her girlfriends. Also, Winston struggles with physical fitness."}, "S04E05": {"name": "Landline", "tvdb_id": 1010232, "overview": "When Coach's liaison with the school nurse gets messy, vice principal Jess must enforce a new, \"no fraternization\" policy among the teachers. But the tables soon get turned when she finds herself attracted to the hot new science teacher. Meanwhile, Nick is enjoying being Schmidt and Winston's secretary, after the loft gets a new home phone"}, "S04E04": {"name": "Micro", "tvdb_id": 1009827, "overview": "To prove that girls aren't shallow, Jess goes out on a date with a guy whose shortcomings fall way below the belt. Meanwhile, Winston and Cece pit Schmidt and Coach against each other, while convincing them they could be male models."}, "S04E10": {"name": "Girl Fight", "tvdb_id": 1017850, "overview": "Schmidt quickly regrets trying to understand the politics of a girl fight when one breaks out between Jess and Cece. Meanwhile, Nick goes on a date with Tran's granddaughter, whom Winston believes is hiding a secret."}, "S03E19": {"name": "Fired Up", "tvdb_id": 972677, "overview": "Jess hires, then must immediately fire Coach as her school’s new volleyball coach. Meanwhile, Schmidt gets sued and enlists Nick and a procedural television-loving Winston to represent him at the deposition. Also, Cece catches the eye of a much younger man."}, "S06E01": {"name": "House Hunt", "tvdb_id": 1216876, "overview": "Jess tries anything and everything to get her mind off of Nick, who returns from his summer in New Orleans sooner than anticipated. Meanwhile, Schmidt and Cece struggle in the search for their first home and Winston deals with having a long-distance relationship with Aly."}, "S01E08": {"name": "Bad In Bed", "tvdb_id": 64903, "overview": "When Jess decides to take her relationship with Paul to the next level, she consults with the guys for some sex advice. Meanwhile, Schmidt worms his way into his boss' baby shower to compete with his office female counterpart."}, "S06E15": {"name": "Glue", "tvdb_id": 1260513, "overview": "When Nick freaks out after Reagan lands him a book signing, Jess scrambles to boost his confidence and help it go smoothly. Meanwhile, Winston reveals to Schmidt and Cece that he's proposing to Aly, but needs their help to execute the big plan"}, "S01E20": {"name": "Normal", "tvdb_id": 64915, "overview": "A nervous Jess invites Russell to spend the weekend at the loft, and her fears are amplified when he gets along better with the guys than she hoped. Meanwhile, Winston begins work at a sports radio station, but quickly finds out his boss is more of a shock jock, and Nick tries to make an invention from his \"Idea Notebook\" into a reality."}, "S02E16": {"name": "Table 34", "tvdb_id": 64935, "overview": "The gang attends a dating convention, where Cece hopes to find a prospective husband - even as Schmidt hopes to win her back. Meanwhile, Winston's mojo returns, and Jess and Nick get put in a compromising position in front of Dr. Sam."}, "S02E02": {"name": "Katie", "tvdb_id": 64921, "overview": "Jess pretends she's someone else when a handsome stranger mistakes her for his blind date. Meanwhile, a patron at Nick's bar claims to be Nick from the future, and Winston's disapproving mother pays him a visit."}, "S05E22": {"name": "Landing Gear", "tvdb_id": 1191087, "overview": "Schmidt makes a last ditch effort to convince Cece's mom to come to their wedding, but in doing so, he might miss the special day himself."}, "S02E03": {"name": "Fluffer", "tvdb_id": 64923, "overview": "Jess and Nick examine their friendship. Elsewhere, Schmidt hopes to impress an attractive Republican by pretending to be one of Mitt Romney's sons."}, "S02E17": {"name": "Parking Spot", "tvdb_id": 64936, "overview": "When Schmidt discovers a previously unknown, yet highly-coveted parking spot, Jess and the roommates battle it out to see who will get to use it. Meanwhile, Winston has a hard time finding a condom when he gets an impromptu invitation from Daisy."}, "S02E01": {"name": "Re-launch", "tvdb_id": 64920, "overview": "Jess is laid off from her teaching job and volunteers to be a shot girl at Schmidt's \"rebranding\" party."}, "S05E08": {"name": "The Decision", "tvdb_id": 1165697, "overview": "Reagan challenges Nick and Winston's indecisiveness when she says she will sleep with only one of them; while looking at wedding venues with Cece, Schmidt runs into his college frenemy, Benjamin."}, "S02E15": {"name": "Cooler", "tvdb_id": 64934, "overview": "Nick and Schmidt go out on a \"bro's night,\" but quickly become infatuated with, and highly competitive over, a beautiful woman attracted to sadness. Meanwhile, Winston falls for a girl with absolutely no interest in him, which only makes him more attracted to her. Then, Jess' decision to have a night alone in the loft doesn't go as planned and involves another round of the drinking game \"True American,\" and a surprising development in her relationship with one of the loft mates."}, "S05E20": {"name": "Return To Sender", "tvdb_id": 1189228, "overview": "Jess meets Sam’s female best friend, Diane. Meanwhile, Nick is worried Gavin will disappoint Schmidt again and Winston is offended by a reaction to a birthday gift."}, "S05E21": {"name": "Wedding Eve", "tvdb_id": 1191086, "overview": "On the night before the wedding, Nick and Winston try to help Schmidt re-write his vows and Jess, thinking that Sam is going to propose to her, rallies the gang into playing True American to avoid giving him an answer."}, "S02E14": {"name": "Pepperwood", "tvdb_id": 64933, "overview": "Nick becomes convinced that a promising student in Jess's adult writing class is a murderer."}, "S05E09": {"name": "Heat Wave", "tvdb_id": 1165701, "overview": "Things heat up between Nick and Reagan over who can provide the loft with the best air conditioning unit. Meanwhile, Winston uses his “cop voice” to help Schmidt prep Cece for a newscaster audition."}, "S02E04": {"name": "Neighbors", "tvdb_id": 64922, "overview": "Jess gets a quartet of very young new neighbors -- and she's determined to win them over, in spite of the fact that to them, she's not a New Girl -- she's an Old Girl"}, "S02E10": {"name": "Bathtub", "tvdb_id": 64929, "overview": "Tired of taking showers, Jess and Winston scheme to get a bathtub in the loft. Then, at the bar, Nick meets a tough and beautiful customer with boyfriend troubles. Meanwhile, Schmidt is torn between his boss and trying to win back Cece."}, "S05E19": {"name": "Dress", "tvdb_id": 1189227, "overview": "Jess races to make alterations to Cece’s bridal dress, while Schmidt tries to keep his “wedding workshop” a secret at work, and Nick struggles to ask Reagan to be his date to the nuptials. Meanwhile, Winston and Aly try to keep their relationship on the down-low at work."}, "S07E08": {"name": "Engram Pattersky", "tvdb_id": 1480968, "overview": "The gang takes a tour down memory lane, which includes a final round of \"True American.\""}, "S02E11": {"name": "Santa", "tvdb_id": 64930, "overview": "When the gang attempts to juggle multiple holiday parties in one night, Jess tries to avoid a remorseful Sam, Nick tries to keep up with a sexually adventurous Angie and Winston panics when he gets a cranberry stuck in his ear."}, "S05E18": {"name": "A Chill Day In", "tvdb_id": 1186057, "overview": "Refusing to accept that their crazy days are behind them, Jess and Cece abandon their low-key bachelorette party plans and seek a night out to top all others."}, "S02E05": {"name": "Models", "tvdb_id": 64924, "overview": "After spending a wild night out with Cece and her model friends, Jess jumps in the driver's seat when she must fill in for Cece at a car show. Meanwhile, the guys question what defines male friendship after Schmidt buys Nick a cookie."}, "S02E13": {"name": "A Father's Love", "tvdb_id": 64931, "overview": "When Nick's con-man father suddenly reappears, Jess tries her best to fix the two men's relationship, despite Nick's fears that he's being used in another one of his dad's gambling schemes. Meanwhile, Schmidt teams up with Robby to try to win back Cece."}, "S02E07": {"name": "Menzies", "tvdb_id": 64926, "overview": "As Jess' job search kicks into high gear, the guys fear her time of the month is also affecting their physical and psychological well-being. Meanwhile, Schmidt begins a \"50 Shades of Grey\"-type of relationship with his corporate boss, and Nick gains wisdom from an unlikely, hands-on (and mute) source."}, "S02E06": {"name": "Halloween", "tvdb_id": 64925, "overview": "Jess gets a job as a zombie at a haunted house, but is more frightened of her changing feelings towards Sam. Schmidt and Cece are perfectly matched in the costumes they're wearing, while Winston and Shelby are worlds apart in theirs. Nick gets a visit from a former college crush who shows her affection in a scary way."}, "S02E12": {"name": "Cabin", "tvdb_id": 64932, "overview": "Jess and Sam go on a weekend getaway with Nick and Angie. But this might not be the trip they expected when Jess starts to party and trouble begins. Could jealousy get in the way of a good time?"}}