{"S02E23": {"name": "The Master Plan", "tvdb_id": 397645, "overview": "Leslie is disappointed when her new park plans are put on hold by a visit from two state auditors. April has plans for Andy at her birthday party, and Ann tries to piece together a romantic mystery."}, "S05E02": {"name": "Soda Tax", "tvdb_id": 397695, "overview": "Leslie decides to wage war on obesity in Pawnee in her first mission as city councilor by passing a city-wide soda tax. Meanwhile, Andy tries to get in shape for his police-entrance exam, and Ben struggles to connect with the interns in his office."}, "S05E16": {"name": "Bailout", "tvdb_id": 397709, "overview": "Leslie is determined to help a local video store stay in business, while Chris offers Tom advice on how to deal with a difficult employee. Elsewhere, Ann resorts to blackmail to get April to be her friend."}, "S07E07": {"name": "Donna and Joe", "tvdb_id": 1038009, "overview": "Donna and Joe tie the knot, while April attempts to keep the wedding running smoothly. Ron creates an awkward situation between Tom and Lucy. Jen Barkley arrives at Ben and Leslie’s house with an interesting opportunity."}, "S07E12": {"name": "One Last Ride (1)", "tvdb_id": 1038014, "overview": "The Parks gang completes one last task together, before saying goodbye to Pawnee."}, "S07E06": {"name": "Save JJ's", "tvdb_id": 1036418, "overview": "Leslie holds a rally in an attempt to keep JJ's Diner from closing. Tom surprises Donna with the ultimate pre-wedding gift."}, "S05E17": {"name": "Partridge", "tvdb_id": 397711, "overview": "Leslie accompanies Ben on a trip to his hometown which has offered him a key to the city. Ron deals with a lawsuit filed against him by Councilman Jamm. Ann and Chris take a parenting compatibility quiz."}, "S05E03": {"name": "How a Bill Becomes a Law", "tvdb_id": 397696, "overview": "Leslie helps a local swim team get more practice time by working on a new law that extends the hours at the community pool; Ron finds himself filling a pothole for a local woman (Lucy Lawless) as part of Chris' new plan to solve citizens' problems around the city; April and Ben take a road trip to Pawnee."}, "S02E22": {"name": "Telethon", "tvdb_id": 397643, "overview": "Leslie hosts a late-night shift for a local telethon, and lands former Indiana Pacer Detlef Schrempf as a celebrity guest. Meanwhile, Mark has big plans for his relationship with Ann."}, "S02E20": {"name": "Summer Catalog", "tvdb_id": 397648, "overview": "Preparing the Summer Events Catalog, Leslie decides to take Ron and the past directors of the Parks Department out for a picnic lunch. Tom enlists the help of Ann and Mark to pose for the cover photo."}, "S05E15": {"name": "Correspondents' Lunch", "tvdb_id": 397710, "overview": "Leslie's speech she prepared for a special event is stolen. Ben begins his new job at the Sweetums Charity Foundation. Ann summons the courage to ask an important question."}, "S05E01": {"name": "Ms. Knope Goes to Washington", "tvdb_id": 397694, "overview": "Leslie and Andy visit Ben and April at their new jobs in Washington D.C., and Leslie feels overwhelmed by the city -- especially after meeting two of her idols. Meanwhile, Ron throws a \"thank you\" barbeque for the entire Parks and Recreation staff."}, "S02E08": {"name": "Ron and Tammy", "tvdb_id": 397628, "overview": "Leslie is upset when she learns the library department wants to take over her lot. Making matters worse, the library is run by Ron's ex-wife Tammy, who still has a powerful emotional hold on him. Meanwhile, Andy gets a job in hopes of winning Ann back."}, "S07E10": {"name": "The Johnny Karate Super Awesome Musical Explosion Show", "tvdb_id": 1038012, "overview": "On the last episode of Andy’s TV show, his friends wish him luck with whatever comes next."}, "S07E04": {"name": "Leslie and Ron", "tvdb_id": 1036416, "overview": "Leslie and Ron attempt to work out their differences."}, "S07E05": {"name": "Gryzzlbox", "tvdb_id": 1036417, "overview": "Leslie and Ben suspect that Gryzzl is invading the privacy of Pawnee residents. April addresses the new Parks and Rec interns, while Tom helps Andy renegotiate a contract."}, "S07E11": {"name": "Two Funerals", "tvdb_id": 1038013, "overview": "Ben and April conduct a series of interviews, while Andy and Donna help Ron adjust to a life change."}, "S02E09": {"name": "The Camel", "tvdb_id": 397632, "overview": "After one of the murals (\"The Spirit of Pawnee\") in City Hall is defaced, Leslie and the Parks Department compete to come up with a new design. Meanwhile, Andy and Ron share an uncomfortable moment at the shoeshine stand."}, "S05E14": {"name": "Leslie and Ben", "tvdb_id": 397705, "overview": "Leslie and Ben are getting married, and have to cram months of planning into two hours. Meanwhile, Ron's temper gets him in trouble."}, "S02E21": {"name": "94 Meetings", "tvdb_id": 397644, "overview": "Ron is furious when April mistakenly schedules a ton of meetings for him. Meanwhile, Leslie fights to preserve a historical landmark."}, "S05E10": {"name": "Two Parties", "tvdb_id": 397703, "overview": "Ben and Leslie's rival bachelor and bachelorette parties each take on a very different tune."}, "S02E19": {"name": "Park Safety", "tvdb_id": 397647, "overview": "After Jerry gets mugged by a bunch of kids, Leslie meets with the head park ranger in hopes of improving park safety. Meanwhile, everyone tries to be nicer to Jerry once he returns to the office."}, "S05E04": {"name": "Sex Education", "tvdb_id": 397698, "overview": "An STD outbreak amongst Pawnee seniors prompts Leslie to conduct a sex education class. Meanwhile, Ron helps Tom adjust to life without technology after his gadgets are taken away, and Ben and April meet Congressman Murray for the first time."}, "S07E01": {"name": "2017", "tvdb_id": 1031228, "overview": "Leslie launches a competition with tech company Gryzzl for a large parcel of land, which she wants to turn into a National Park. April and Andy try to regain their spontaneity. Ben is recognized at a Bicentennial gala, where Tom delivers a speech in his honor."}, "S02E24": {"name": "Freddy Spaghetti", "tvdb_id": 397649, "overview": "When Ben prevents Leslie from holding a children’s concert, she takes matters into her own hands. Mark makes some big decisions about his life, and Andy gets some unexpected romantic attention."}, "S05E05": {"name": "Halloween Surprise", "tvdb_id": 397699, "overview": "A new job offer for Ben causes Leslie to contemplates their future. Meanwhile, Ron and Andy take Diane's girls out trick-or-treating, and Tom searches for a new business idea."}, "S05E11": {"name": "Women in Garbage", "tvdb_id": 397708, "overview": "Leslie is at a loss for words after the speech she prepared for a special event is stolen. Meanwhile, Ben begins his new job at the Sweetums Charity Foundation, and Ann summons the courage to ask an important question."}, "S02E18": {"name": "The Possum", "tvdb_id": 397646, "overview": "When a possum bites the mayor's dog on a golf course, Leslie is asked to form a task force to catch the pesky animal. Meanwhile, Ron is upset when Mark refuses to bend the rules for him."}, "S05E07": {"name": "Leslie vs. April", "tvdb_id": 397700, "overview": "Leslie gets upset when April tries to get Lot 48 made into a dog park. Meanwhile, Tom enlists Ben’s help as he tries to launch his new business venture, and Andy hones his crime scene investigation skills."}, "S05E13": {"name": "Emergency Response", "tvdb_id": 397706, "overview": "Leslie and Ben organize a black tie gala to raise money for their park, but their plans are derailed when a city-wide emergency response drill is called. Meanwhile, Andy prepares to take his Police Academy Exam and Ron fills in for Leslie on Pawnee Today."}, "S07E02": {"name": "Ron and Jammy", "tvdb_id": 1031229, "overview": "Leslie and Ron briefly put aside their feud to help old foe Jeremy Jamm escape the clutches of the diabolical Tammy 2. Ben vows to help April discover her true passion in life, while Andy and Tom travel to Chicago."}, "S07E03": {"name": "William Henry Harrison", "tvdb_id": 1032738, "overview": "Leslie's team tries to strengthen her case that the Newport land should be turned into a National Park. Ron's team, fighting back, brings on a celebrity as a minority owner."}, "S05E12": {"name": "Ann's Decision", "tvdb_id": 397704, "overview": "Ann tries to get to know herself as Leslie meddles in one of her biggest life decisions. Meanwhile, things go south when Ben enlists the guys to help choose a caterer for the wedding."}, "S05E06": {"name": "Ben's Parents", "tvdb_id": 397697, "overview": "Leslie is nervous about meeting Ben's divorced parents. Tom prepares to pitch his new business to Ron with Jean-Ralphio's help. Chris rides an emotional rollercoaster."}, "S01E05": {"name": "The Banquet", "tvdb_id": 397625, "overview": "During a banquet honoring her mother's public service, Leslie tries to convince a local zoning official to support her proposed park project. Meanwhile, Mark and Tom try to meet some ladies."}, "S06E18": {"name": "Prom", "tvdb_id": 973398, "overview": "Leslie helps organize the high school's Senior Prom, and battles with Ron over the future employment of a bright high school senior. Andy takes an unwilling April as his date, and Tom is tasked with DJ'ing and agrees to let Ben help."}, "S04E21": {"name": "Bus Tour", "tvdb_id": 397692, "overview": "An important person in Pawnee dies while Leslie is on a bus tour for the final day of her campaign. Meanwhile Andy investigates a security threat, and Chris finds a cure for his depression."}, "S04E09": {"name": "The Trial of Leslie Knope", "tvdb_id": 397681, "overview": "Leslie has to face an ethics committee about her secret relationship with Ben after they come clean to Chris."}, "S03E14": {"name": "Road Trip", "tvdb_id": 397661, "overview": "When Chris sends Leslie and Ben on a trip to Indianapolis, Leslie is afraid she won't be able to deny her feelings for him. Ron teaches a young student about his views on government. Meanwhile, Andy gets his feelings hurt by April after playing Tom's new game."}, "S03E15": {"name": "The Bubble", "tvdb_id": 397665, "overview": "Everyone in the office is unhappy when Chris decides to make some big changes in the parks department -- especially Tom who starts to question his career choices. Leslie is caught off guard when Ben has a meeting with her mom."}, "S03E01": {"name": "Go Big or Go Home", "tvdb_id": 397651, "overview": "Leslie and the Parks Department return to work after three months to discover that the budget crisis still looms. After unsuccessfully trying to have their budget restored by using Ann to charm Chris with a date, Leslie decides to make an all or nothing play by resurrecting the Pawnee Harvest Festival. Meanwhile, Ben restarts the youth basketball league and instates Ron and Andy to coach the only two teams. April returns from a vacation with a new boyfriend."}, "S04E08": {"name": "Smallest Park", "tvdb_id": 397679, "overview": "Leslie uses her new tourist attraction as a way to spend more time with Ben. Meanwhile, Ron  and April encourage Andy to go to college, and Chris tasks Tom and Jerry with revamping the Parks and Rec logo."}, "S04E20": {"name": "The Debate", "tvdb_id": 397691, "overview": "Leslie goes toe-to-toe with Bobby Newport in a debate. Ann, Tom, and Chris work in the media spin room, while Ron goes the extra mile to save a party for Leslie's donors."}, "S06E19": {"name": "Flu Season 2", "tvdb_id": 973780, "overview": "In the midst of flu season, a sick Leslie and Andy struggle to book performers for the Unity Concert. Meanwhile, Tom heads to a wine competition in search of a sommelier for his new restaurant, and Ben seeks drunken help from Ron with a personal problem."}, "S01E04": {"name": "Boys' Club", "tvdb_id": 397624, "overview": "Leslie attempts to break into the political \"old boy's club,\" causing an ethical dilemma. Meanwhile, Andy plans a surprise for Ann."}, "S01E06": {"name": "Rock Show", "tvdb_id": 397626, "overview": "Leslie attends what she believes is a business meeting with an elderly local government bigwig, unaware that her mother has secretly set her up on a blind date. Andy plays his first gig since breaking both of his legs in the pit."}, "S04E22": {"name": "Win, Lose, or Draw", "tvdb_id": 397693, "overview": "It's election day in Pawnee, and Leslie and Bobby Newport are separated by a razor-thin margin. While everyone waits with Leslie for the race to be called, they ponder their futures, and their new opportunities."}, "S03E03": {"name": "Time Capsule", "tvdb_id": 397653, "overview": "Leslie wants to bury a time capsule that encapsulates life in Pawnee, but an odd suggestion from a local man causes unforeseen consequences. Andy seeks help from Chris about how to win back April."}, "S03E02": {"name": "Flu Season", "tvdb_id": 397652, "overview": "While planning for the local Harvest Festival, Leslie is struck with the flu and is forced to go to the hospital. Ron and Andy have a day of male bonding, and Tom hits the spa."}, "S03E16": {"name": "Li'l Sebastian", "tvdb_id": 397666, "overview": "Leslie and the parks team put together a memorial service for a dearly departed friend. Meanwhile, Tom makes a big life decision, while Chris reacts badly to a health problem."}, "S01E03": {"name": "The Reporter", "tvdb_id": 397623, "overview": "Leslie arranges for a reporter to do a story about her park project, but she and her committee have the worst time staying on topic. She then calls Mark to help her save the story, but it ends up hurting more than helping. Meanwhile, Tom does all he can to suck up to his boss."}, "S03E12": {"name": "Eagleton", "tvdb_id": 397664, "overview": "Leslie's ex-best friend, Lindsay Carlisle Shay, launches an attack on Pawnee, banning residents from visiting a nearby park in the neighboring city of Eagleton with a large fence, causing Leslie to go to war with Eagleton. Meanwhile, everyone finds out that it is Ron's birthday, a fact that he went to extreme lengths to conceal."}, "S03E06": {"name": "Indianapolis", "tvdb_id": 397656, "overview": "Ron and Leslie take a road trip to the big city in order to visit Ron's favorite place which happens to be a steakhouse, but Leslie has alternative motives for the trip."}, "S03E07": {"name": "Harvest Festival", "tvdb_id": 397658, "overview": "It's make it or break it for the Parks Department at the Harvest Festival which is full of surprises."}, "S03E13": {"name": "The Fight", "tvdb_id": 397663, "overview": "When Leslie tries to get Ann a job at city hall, her lukewarm reaction causes their first-ever fight. Tom invites the entire department to the Snakehole Lounge to help him promote his new alcohol, \"Snake Juice.\""}, "S01E02": {"name": "Canvassing", "tvdb_id": 397622, "overview": "Leslie decides that she and her committee need to go door-to-door to gain support for the park project as well as support for an upcoming town hall meeting, but their mission does not go as planned. Meanwhile, Tom wanders away from the canvassing group and uses his own creative recruitment tactics."}, "S06E09": {"name": "The Cones of Dunshire", "tvdb_id": 968334, "overview": "Leslie faces off with Councilman Jamm; Ben gets a new hobby; Tom, April and Donna help Ron sell his cabin."}, "S06E21": {"name": "Moving Up (1)", "tvdb_id": 974342, "overview": "Leslie, Ben, and Andy head to San Francisco for a National Parks Conference. Tom opens his restaurant, Ron has another run-in with his ex-wife Tammy 2, Andy lives a rock and roll fantasy, and Leslie makes a huge decision about her future."}, "S03E05": {"name": "Media Blitz", "tvdb_id": 397655, "overview": "While advertising for the Harvest Festival, Ben has to deal with some troubling questions about his past. Meanwhile, Andy continues to try to win April back."}, "S03E11": {"name": "Jerry's Painting", "tvdb_id": 397662, "overview": "Jerry’s contribution to Leslie’s community art show causes a stir. Ben moves in with April and Andy and attempts to teach them how to be adults. Meanwhile, Leslie is frustrated by Chris and his interoffice dating rules."}, "S04E18": {"name": "Lucky", "tvdb_id": 397688, "overview": "Leslie and Ben are thrilled when Buddy Wood wants to interview Leslie for his Indianapolis talkshow. April and Ron prep Andy for his final exam in his Women’s Studies course."}, "S03E10": {"name": "Soulmates", "tvdb_id": 397659, "overview": "Leslie tries an online dating service, but doesn't end up with a stranger as she expects. Also, Chris challenges Ron to a grilling competition as part of his plans to make Pawnee healthier."}, "S04E19": {"name": "Live Ammo", "tvdb_id": 397690, "overview": "Leslie discovers that the Parks Department budget is about to be cut, and she later meets the City Council member she is running to replace. Chris and Ron visit a meditation center."}, "S03E04": {"name": "Ron & Tammy: Part Two", "tvdb_id": 397654, "overview": "Tom tries to get back at Ron by going out on a date with Ron's ex-wife Tammy, while Leslie tries to protect Ron from falling prey to her charms. Meanwhile, April is assigned to work with Chris."}, "S06E20": {"name": "One in 8,000", "tvdb_id": 974114, "overview": "Leslie and Ben run a charity auction to raise funds for the unity concert. April steps in to manage Andy's schedule, while Donna asks Ron for help with her ex-boyfriend."}, "S01E01": {"name": "Pilot", "tvdb_id": 397621, "overview": "Indiana government worker Leslie Knope is given the assignment to convert an abandoned quarry pit into a community park. A documentary film crew follows Leslie through her mishaps and gaffes as she tries to make her assignment a reality."}, "S06E08": {"name": "Fluoride", "tvdb_id": 968086, "overview": "Leslie tries to complete some of her biggest city council goals, like hosting an NFL Play 60 event with the Indianapolis Colts, and trying to add fluoride to Pawnee’s drinking water. Meanwhile, Chris and Ron attempt to bond while building cribs for their future children."}, "S06E11": {"name": "New Beginnings", "tvdb_id": 970336, "overview": "Leslie and Ben both face new challenges on the first day of new jobs. Donna, April and Andy play a prank on Ben, while Tom prepares for a big presentation. Meanwhile Ann and Chris contemplate taking a big leap together."}, "S06E05": {"name": "Gin It Up!", "tvdb_id": 397719, "overview": "Leslie tries to calm a minor scandal that gets blown out of proportion. Tom tries to impress a new love interest, while Ben convinces Ron to prepare a will."}, "S04E14": {"name": "Operation Ann", "tvdb_id": 397685, "overview": "Leslie works to find Ann a Valentine's date. Ron helps Ben with a scavenger hunt, and Chris becomes depressed over his love life."}, "S03E09": {"name": "Andy and April's Fancy Party", "tvdb_id": 397660, "overview": "April and Andy host a dinner party for the Parks Department. Meanwhile, Ann tries to move on from Chris at a singles' party."}, "S04E01": {"name": "I'm Leslie Knope", "tvdb_id": 397672, "overview": "Leslie is torn between Ben and her dreams of running for public office, while Ron braces himself for the arrival of his first wife, the original Tammy."}, "S03E08": {"name": "Camping", "tvdb_id": 397657, "overview": "Leslie takes the whole department camping in order to brainstorm new ideas. Meanwhile, Andy attempts a romantic gesture for April, while Ann gets nervous when Chris returns to Pawnee as the new city manager."}, "S04E15": {"name": "Dave Returns", "tvdb_id": 397687, "overview": "While trying to get an endorsement from the Chief of Police, Leslie and Ben awkwardly run into Leslie's old flame, Dave. Meanwhile, Andy and the rest of the office work on a theme song for Leslie's campaign."}, "S06E04": {"name": "Doppelgängers", "tvdb_id": 397718, "overview": "Leslie pairs up the Pawnee Parks employees with their Eagleton counterparts. Meanwhile Ben and Chris reunite for an accounting project, and Ann reveals her plans for the future."}, "S06E10": {"name": "Second Chunce", "tvdb_id": 969980, "overview": "Leslie comes to terms with her last day in office and plans for the future with Ben. Chris and Ann find out the sex of their child, Andy comes home from London, and Tom looks to the future."}, "S06E06": {"name": "Filibuster", "tvdb_id": 397720, "overview": "Leslie throws Ben a birthday bash but is forced to leave early for an emergency late-night filibuster. Tom tries to make some memories with his new girlfriend, Ron and Donna go hunting. April reconnects with Andy."}, "S06E12": {"name": "Farmers Market", "tvdb_id": 970527, "overview": "Leslie fights with Ben over questionable sales techniques at the local farmers market. Ann searches for a way to vent about the annoying aspects of pregnancy, while April supports Andy in a new creative venture."}, "S04E03": {"name": "Born and Raised", "tvdb_id": 397675, "overview": "Leslie's book about Pawnee comes out just in time for her campaign. Ann tries to bond with Ron and April."}, "S04E17": {"name": "Campaign Shake-Up", "tvdb_id": 397689, "overview": "Leslie and Ben are caught off guard when her opponent Bobby Newport hires a powerful campaign manager from Washington. Chris forces Ron to start interviewing replacements for Leslie when work starts falling through the cracks, and an unlikely officemate solves a challenging problem."}, "S04E16": {"name": "Sweet Sixteen", "tvdb_id": 397686, "overview": "Leslie realizes that the department has forgotten Jerry's birthday and decides to throw a party for him at a special location. Meanwhile, Tom is flabbergasted when he finds out Ann doesn't share his taste in music."}, "S04E02": {"name": "Ron and Tammys", "tvdb_id": 397673, "overview": "Ron's first ex-wife, Tammy One, reenters his life and tries to control his every move. Meanwhile, Ben helps Tom balance the books at his new company, and Ann makes a PSA, with help from Chris."}, "S06E13": {"name": "Ann and Chris", "tvdb_id": 970780, "overview": "On Ann and Chris's last night in Pawnee, Leslie throws a grand farewell party and attempts to fulfill one last promise. Meanwhile, Tom, Ben, Ron and Andy struggle to find the perfect going away gift for Chris."}, "S06E07": {"name": "Recall Vote", "tvdb_id": 967015, "overview": "Leslie prepares a haunted house with Ben, Ann and Chris for Halloween on the day of the recall vote. Meanwhile, Tom fears the end of Rent-A-Swag and persuades Ron to help save his business."}, "S06E03": {"name": "The Pawnee-Eagleton Tip-Off Classic", "tvdb_id": 397717, "overview": "Ben, Leslie and Chris meet with Eagleton city councilor Ingrid de Forest to discuss financial matters; Ann brings April to vet school orientation; Ron tries to get off the grid."}, "S06E17": {"name": "Galentine's Day", "tvdb_id": 972808, "overview": "Leslie throws a hasty Galentine’s Day in an attempt to find a replacement for Ann. Tom and Ben look to finalize a deal on tents for the Unity Concert, while Ron finds himself looking after Andy."}, "S04E06": {"name": "End of the World", "tvdb_id": 397677, "overview": "A local Pawnee group predicts the end of days, causing chaos in the Parks department."}, "S04E12": {"name": "Campaign Ad", "tvdb_id": 397684, "overview": "Faced with a tough new opponent, Leslie and Ben disagree on the content of her first campaign ad. Ron is very uncomfortable when Chris tries to befriend him, while Andy and April make a trip to the doctor."}, "S04E13": {"name": "Bowling for Votes", "tvdb_id": 397682, "overview": "Leslie and Ben host a bowling night after receiving feedback about Leslie's campaign. April, Chris, and Jerry hold a competition to see who can raise the most funds."}, "S04E07": {"name": "The Treaty", "tvdb_id": 397678, "overview": "Leslie enlists the help of Ben, Andy and April to host a Model U.N. for Pawnee Central High School. Chris asks Ann for her advice on love when a date cancels on him. Meanwhile, Ron struggles to find a replacement for Tom."}, "S06E16": {"name": "New Slogan", "tvdb_id": 972807, "overview": "Leslie aims to create a new town slogan, but runs afoul of local shock jocks. Andy scouts bands to play the Unity Concert and discovers an interesting secret about Ron, while Tom looks for a restaurant locale with Donna and April."}, "S06E14": {"name": "Anniversaries", "tvdb_id": 971846, "overview": "Ben attempts to surprise Leslie with a special anniversary gift. Tom and Adam try to help Leslie bring positive light to the Pawnee-Eagleton merger, while April asserts her new authority as Donna’s boss."}, "S04E11": {"name": "The Comeback Kid", "tvdb_id": 397683, "overview": "Leslie enlists everyone's help in staging an attention-getting event. Ben takes up a new hobby, while April and Andy adopt a pet."}, "S04E05": {"name": "Meet 'n' Greet", "tvdb_id": 397676, "overview": "Andy and April host a Halloween bash at their house. Tom emcees an event for Leslie's campaign. Andy and April receive an unusual wedding present from Ron and Ann."}, "S04E04": {"name": "Pawnee Rangers", "tvdb_id": 397674, "overview": "Ron takes his boys-only troop of Pawnee Rangers into the wild. Not wanting the girls to feel left out, Leslie also takes her troop of Pawnee Goddesses on an adventure weekend. Meanwhile, a reluctant Ben joins Tom and Donna for a day of relaxation, and Chris spends some time with Jerry."}, "S04E10": {"name": "Citizen Knope", "tvdb_id": 397680, "overview": "Unable to get work done from inside the Parks Department, Leslie forms a citizen action group and fights from the outside. Meanwhile, everyone in the office brainstorms ideas for what to get Leslie for Christmas."}, "S06E01": {"name": "London (1)", "tvdb_id": 397716, "overview": "Leslie wins an award from an international Women in Government organization, and travels to London with Ben, Andy, April and Ron to accept it."}, "S06E15": {"name": "The Wall", "tvdb_id": 971991, "overview": "Leslie's efforts to take down the wall separating Eagleton and Pawnee yield unexpected results; Ben and Tom meet with possible sponsors for the concert; Ron finds a new hobby."}, "S02E16": {"name": "Galentine's Day", "tvdb_id": 397631, "overview": "When Leslie hears her mom’s story about an old flame, she and her boyfriend Justin track him down and reunite them on Valentine’s Day. Meanwhile, Andy and his band are nervous about playing a gig at the Senior Center."}, "S02E02": {"name": "The Stakeout", "tvdb_id": 397627, "overview": "While tending to the new community garden, Leslie and Tom discover someone has planted marijuana among the vegetables. In an effort to catch the people responsible, they pull an all-night stakeout. With Leslie's permission, Ann decides to go on a date with Mark."}, "S05E22": {"name": "Are You Better Off?", "tvdb_id": 397707, "overview": "Leslie celebrates her first year as a city councilwoman. Retired Special Agent Burt Macklin is recalled to action. April gets some life-changing news. Tom debates a big business opportunity."}, "S02E03": {"name": "Beauty Pageant", "tvdb_id": 397642, "overview": "Leslie gets to judge a beauty contest, but ends up having conflicting opinions on \"the ideal woman\" with the other judges. While on a date with Mark, Ann learns Andy has been living in the pit."}, "S02E17": {"name": "Woman of the Year", "tvdb_id": 397637, "overview": "Leslie is outraged when Ron wins a “Woman of the Year” award for a project she started. Meanwhile, Tom is desperate to find some money to invest in a local Pawnee club."}, "S02E01": {"name": "Pawnee Zoo", "tvdb_id": 397629, "overview": "When Leslie decides to marry two penguins to promote the local zoo, she inadvertently causes an uproar when both penguins turn out to be male. Meanwhile, Mark puts Ann in an awkward situation when he asks her to go see a movie."}, "S05E08": {"name": "Pawnee Commons", "tvdb_id": 397701, "overview": "Leslie and Ben meet with an architect from their rival town, Eagleton, about designs for a new park."}, "S02E15": {"name": "Sweetums", "tvdb_id": 397641, "overview": "The Parks Department forms a partnership with a local company to sell energy bars at the parks in Pawnee, but Leslie tries to stop the deal when she discovers how unhealthy the snacks are. Mark reluctantly agrees to help Tom move out of his house."}, "S05E20": {"name": "Jerry's Retirement", "tvdb_id": 397714, "overview": "When Leslie finds out Jerry is retiring, she struggles with the proper way to commemorate the occasion. Chris and Ann prepare to have a baby together. Tom worries he will become the office punching bag once Jerry leaves."}, "S05E21": {"name": "Swing Vote", "tvdb_id": 397715, "overview": "Leslie deems Ron's budget-cut proposals unacceptable. Andy and Ben celebrate a big donation made to their charity. Ann tries to solve Tom's girlfriend troubles."}, "S02E14": {"name": "Leslie's House", "tvdb_id": 397633, "overview": "After an amazing date with Justin in Indianapolis, Leslie tries to impress him with a dinner party at her house."}, "S05E09": {"name": "Ron and Diane", "tvdb_id": 397702, "overview": "Ron, Diane, and Leslie attend a wood working awards dinner after one of Ron's handcrafted chairs is nominated, but the happy occasion is threatened by the arrival of Tammy II. Meanwhile, Jerry hosts a holiday party at his home with his wife, and some of his friends are shocked to find they were not invited."}, "S02E04": {"name": "Practice Date", "tvdb_id": 397636, "overview": "Leslie is nervous about her first date with Dave, so Ann takes her on a practice date to help her prepare. Meanwhile, after a local councilman is caught up in a sex scandal, Tom, Ron, April and Mark decide to see who can uncover the worst dirt on each other."}, "S02E10": {"name": "Hunting Trip", "tvdb_id": 397639, "overview": "Leslie tries to prove she can hang with the guys so she invites herself on Ron’s annual hunting trip, but things don’t go as planned. Meanwhile, April and Andy bond in the office while everyone is away."}, "S05E19": {"name": "Article Two", "tvdb_id": 397713, "overview": "Leslie works to get rid of outdated laws from the original town charter. April and Ron receive management training from Chris. Ben finds himself in a bidding war against Ann to win a present for Leslie."}, "S07E08": {"name": "Ms. Ludgate-Dwyer Goes to Washington", "tvdb_id": 1038010, "overview": "While Leslie and April take a business trip to Washington, April wrestles with her future. Back in Pawnee, Andy tries to find April the perfect job."}, "S07E09": {"name": "Pie-Mary", "tvdb_id": 1038011, "overview": "Leslie and Ben come under fire for participating in an old Pawnee tradition. April and Ron go on a scavenger hunt. Donna and Garry stroll down memory lane."}, "S02E11": {"name": "Tom's Divorce", "tvdb_id": 397650, "overview": "After Leslie finds out that Tom is getting a divorce, the department takes him out on the town to cheer him up. Meanwhile, Andy tries to hustle Mark in a game of pool."}, "S05E18": {"name": "Animal Control", "tvdb_id": 397712, "overview": "Leslie decides to give the Animal Control Department a much-needed makeover. Ann tries to get Ron the medical attention he needs. Ben, Tom, and Andy recruit donors for their charity foundation."}, "S02E05": {"name": "Sister City", "tvdb_id": 397635, "overview": "Leslie plays host to the Parks and Recreation department from Pawnee’s sister city, Boraqua, Venezuela, and is shocked at the cultural differences. Tom becomes an errand boy, and April plays hard to get."}, "S02E13": {"name": "The Set Up", "tvdb_id": 397634, "overview": "Ann sets Leslie up on a blind date with a co-worker, which does not go as well as Leslie hoped. An old friend of Ann's makes Mark feel insecure."}, "S02E07": {"name": "Greg Pikitis", "tvdb_id": 397630, "overview": "Leslie enlists the help of Dave and Andy in order to catch a local teen vandal. Meanwhile, Ann struggles to make her Halloween party fun, and ends up getting help from an unlikely source."}, "S02E06": {"name": "Kaboom", "tvdb_id": 397638, "overview": "Leslie, Ann and the rest of the Parks Department volunteer to help the organization KaBOOM! build a playground for a neighboring town. After building an entire playground in one day, Leslie gets frustrated at the lack of progress with the pit, and takes some advice from Mark to cut through the red tape."}, "S02E12": {"name": "Christmas Scandal", "tvdb_id": 397640, "overview": "Leslie designs the Pawnee Winter Wonderland Festival, but has to hide from the press when a meeting with a disgraced Councilman lands her in the middle of a sex scandal. Meanwhile, Ron offers to cover for Leslie for the day, and quickly discovers how much work she really does."}}