{
    "S05E02": {
        "name": "The Gang Hits the Road",
        "tvdb_id": 213093,
        "overview": "The gang tries to expand their horizons by going on a road trip to the Grand Canyon."
    },
    "S15E07": {
        "name": "Dee Sinks in a Bog",
        "tvdb_id": 3331822,
        "overview": "Mac spends a day at the seminary to truly understand what it takes to become a priest. Dennis and Frank plan an elaborate trap to humiliate Charlie's pen pal. Dee prepares for a date with an Irish doctor. Charlie bonds with his pen pal."
    },
    "S09E02": {
        "name": "Gun Fever Too: Still Hot",
        "tvdb_id": 213146,
        "overview": "After Frank appears on Local Television advocating gun ownership, the rest of the gang takes a look at the ownership process and alternatives to find a common ground on this still heated issue."
    },
    "S07E07": {
        "name": "Chardee MacDennis: The Game of Games",
        "tvdb_id": 213124,
        "overview": "The gang plays the most twisted board game ever. Dee and Dennis face Mac, Charlie and Frank."
    },
    "S07E13": {
        "name": "The High School Reunion (2): The Gang's Revenge",
        "tvdb_id": 213130,
        "overview": "The gang come up with a new plan to buff their tarnished high-school reputations at their reunion."
    },
    "S07E12": {
        "name": "The High School Reunion (1)",
        "tvdb_id": 213129,
        "overview": "The gang have much to prove when they attend their high-school reunion. They meet old friends and make new foes as they stroll down memory lane."
    },
    "S07E06": {
        "name": "The Storm of the Century",
        "tvdb_id": 213123,
        "overview": "As a hurricane threatens Philadelphia, Mac, Dennis and Charlie go to a mall to buy supplies and check out the large breasted TV reporter broadcasting from there, while Frank and Dee prepare Paddy's, and its basement bunker, for the storm."
    },
    "S09E03": {
        "name": "The Gang Tries Desperately to Win an Award",
        "tvdb_id": 213144,
        "overview": "Tired of failing to be recognized for their years of service in the bar industry, the gang changes their ways to give the patrons what they think they want."
    },
    "S15E06": {
        "name": "The Gang's Still in Ireland",
        "tvdb_id": 3331821,
        "overview": "Dennis and Dee explore their new accommodations in the countryside. Frank accompanies Charlie to find the truth about Charlie's Irish childhood pen pal. Mac has an identity crisis and decides to join the seminary."
    },
    "S05E03": {
        "name": "The Great Recession",
        "tvdb_id": 213094,
        "overview": "With a shantytown taking shape outside, Mac and Dennis try to keep Paddy's going in tough times. Meanwhile, Frank and Dee start a family business."
    },
    "S05E01": {
        "name": "The Gang Exploits the Mortgage Crisis",
        "tvdb_id": 213099,
        "overview": "Dennis, Mac, and Frank go into real estate, while Dee sets out to be a surrogate for a wealthy couple. Charlie gets into it with an attorney over the law."
    },
    "S02E08": {
        "name": "The Gang Runs for Office",
        "tvdb_id": 213061,
        "overview": "Driven by Frank's insight into the world of politics, Dennis pursues a political career by running for office."
    },
    "S15E04": {
        "name": "The Gang Replaces Dee With a Monkey",
        "tvdb_id": 3331819,
        "overview": "When the Gang suspects Dee is menopausal, they scramble to find a new employee for Paddy's Pub. Dee decides to put her acting career on hold in order to mentor young actors."
    },
    "S10E08": {
        "name": "The Gang Goes on Family Fight",
        "tvdb_id": 1041623,
        "overview": "When the gang appears on a nationally broadcasted game show, Dennis does his best to keep the gang’s weirdness under wraps."
    },
    "S09E01": {
        "name": "The Gang Broke Dee",
        "tvdb_id": 213151,
        "overview": "The gang attempts to cheer up a deeply depressed Dee, realizing they are the cause for her predicament."
    },
    "S07E10": {
        "name": "How Mac Got Fat",
        "tvdb_id": 213128,
        "overview": "Step inside the confession booth with Mac as he tells a befuddled priest why his fatness is the fault of the other members of The Gang."
    },
    "S07E04": {
        "name": "Sweet Dee Gets Audited",
        "tvdb_id": 213122,
        "overview": "Dee faces an IRS audit over her claim that the baby she carried as a surrogate is her dependent, while the guys decide to run the bar in an unemotional, democratic manner rather than their typical method of shouting and personal attacks."
    },
    "S07E05": {
        "name": "Frank's Brother",
        "tvdb_id": 213120,
        "overview": "When Frank's long lost brother Gino shows up at the bar, the two of them tell the gang about the jazz club they ran in the 1960s and 70s, and how they fell out over Shadynasty, a singer who was the love of both of their lives."
    },
    "S07E11": {
        "name": "Thunder Gun Express",
        "tvdb_id": 213126,
        "overview": "Traffic problems as a result of the President's visit to Philadelphia makes it difficult for the gang to see the summer's biggest film, \"Thunder Gun Express\"."
    },
    "S10E09": {
        "name": "Frank Retires",
        "tvdb_id": 1044435,
        "overview": "Frank decides to retire; the foursome begin to plot and plan ways for each of them to take control of the bar."
    },
    "S15E05": {
        "name": "The Gang Goes to Ireland",
        "tvdb_id": 3331820,
        "overview": "The gang's in Dublin where Dennis ends up helping Frank with some of his business's dirty work. Mac and Charlie learn about their Irish heritage. Dee rushes to the set of an Irish soap opera, where she will play an \"Obnoxious American MILF.\""
    },
    "S02E09": {
        "name": "Charlie Goes America All Over Everybody's Ass",
        "tvdb_id": 213057,
        "overview": "Dennis and Mac make a decision to take away all rules concerning moral and behavioral etiquette at Paddy's after an argument about the Constitution. Frank uses the decision and it's following consequences to his own gain. Meanwhile, Charlie tries to convey his love for America by protesting while Dee attempts to reaffirm her goal of being an actress."
    },
    "S05E10": {
        "name": "The D.E.N.N.I.S. System",
        "tvdb_id": 213098,
        "overview": "Dennis reveals his foolproof system for seducing any woman to the rest of the gang, but they don't grasp the concept."
    },
    "S05E04": {
        "name": "The Gang Gives Frank an Intervention",
        "tvdb_id": 213101,
        "overview": "Frank's behavior is more bizarre than usual---so bizarre that even the gang notice---so they decide to stage an intervention."
    },
    "S12E08": {
        "name": "The Gang Tends Bar",
        "tvdb_id": 1260574,
        "overview": "It’s Valentine’s Day and Paddy’s is packed with customers. Dennis implores the gang to do one day of actual work but everyone else is distracted by a mystery crate Cricket spotted in the alley. Eventually, the gang becomes convinced Dennis really wants them to work on their relationships and everyone shares their grievances without much resolution."
    },
    "S15E01": {
        "name": "2020: A Year in Review",
        "tvdb_id": 3321040,
        "overview": "The Gang looks back on 2020 to justify their numerous PPE loans. In doing so, it is revealed that they contributed to the chaos of the past political year way more than anyone could have imagined."
    },
    "S07E01": {
        "name": "Frank's Pretty Woman",
        "tvdb_id": 213118,
        "overview": "With Frank intent on marrying a prostitute, The Gang tries to make the best of it by attempting an image makeover to uncover the heart of gold that exists deep inside Frank’s “pretty woman.”"
    },
    "S09E04": {
        "name": "Mac and Dennis Buy a Timeshare",
        "tvdb_id": 213152,
        "overview": "The gang does their best to recoup their investments in questionable schemes by dumping their losses on Ben the soldier while trying to avoid being duped again by whatever mastermind is pulling their strings."
    },
    "S09E10": {
        "name": "The Gang Squashes Their Beefs",
        "tvdb_id": 968375,
        "overview": "When some bad blood with old foes compromises their ideal Thanksgiving, the gang decides to make amends by breaking bread with those they've hurt."
    },
    "S09E05": {
        "name": "Mac Day",
        "tvdb_id": 968369,
        "overview": "Everyone in the gang gets a day to do what they want while everyone else in the gang must participate willingly. This is Mac's Day... and its got twice the \"Mac\"."
    },
    "S12E09": {
        "name": "A Cricket's Tale",
        "tvdb_id": 1279281,
        "overview": "We get to see a typical day in Cricket's world and then a possible redemption when his family intervenes. Will Cricket finally move on from the gang, finding love in the process? Will Cricket go from filthy beast to his former self, Matthew Mara?"
    },
    "S05E05": {
        "name": "The Waitress Is Getting Married",
        "tvdb_id": 213100,
        "overview": "The waitress is getting married, Dee is jealous that she's beating her to the altar, so she tries to derail the wedding."
    },
    "S05E11": {
        "name": "Mac and Charlie Write a Movie",
        "tvdb_id": 213103,
        "overview": "When Dee gets a part in the new M. Night Shyamalan film, Mac and Charlie seize a chance to pitch their movie script."
    },
    "S05E07": {
        "name": "The Gang Wrestles for the Troops",
        "tvdb_id": 213097,
        "overview": "The gang puts together a wrestling show for returning troops. Meanwhile, Dee finally meets the soldier that she has been communicating with over the internet."
    },
    "S15E02": {
        "name": "The Gang Makes Lethal Weapon 7",
        "tvdb_id": 3321041,
        "overview": "Upon discovering that their self-made Lethal Weapon sequels have been pulled from the local library, the Gang decides to address their political incorrectness by making another film — Lethal Weapon 7."
    },
    "S07E02": {
        "name": "The Gang Goes to the Jersey Shore",
        "tvdb_id": 213119,
        "overview": "Dee and Dennis take the gang to their favorite childhood vacation spot where things aren't quite how they remember. While Dee and Dennis see the seedy side of the Jersey Shore, Mac, Frank and Charlie have the nights of their lives."
    },
    "S09E07": {
        "name": "The Gang Gets Quarantined",
        "tvdb_id": 968372,
        "overview": "The gang voluntarily quarantine themselves inside of Paddy's in an attempt to keep their singing voices pristine for an upcoming competition when a severe flu outbreak sweeps Philadelphia."
    },
    "S09E06": {
        "name": "The Gang Saves the Day",
        "tvdb_id": 968371,
        "overview": "A routine trip to a convenience store places the gang in the middle of an armed robbery."
    },
    "S07E03": {
        "name": "Frank Reynolds' Little Beauties",
        "tvdb_id": 213121,
        "overview": "Frank finds himself in the child beauty-pageant business and fears that people might think that he's in it for the wrong reasons. Meanwhile, Dee wages war on stage moms, and Mac, Dennis and Charlie think they have found a contestant to back."
    },
    "S15E03": {
        "name": "The Gang Buys a Roller Rink",
        "tvdb_id": 3331818,
        "overview": "In the past, an innocent Dennis learns the horrifying details of Frank's business, a truly sweet Dee is excited to head off for Hollywood, while Charlie and Mac's jobs at the roller rink are in jeopardy."
    },
    "S05E12": {
        "name": "The Gang Reignites the Rivalry",
        "tvdb_id": 213095,
        "overview": "After being banned for 10 years from a local drinking competition appropriately named \"Flipadelphia,\" the gang tries to reignite their old rivalry with another local bar. Finding that they are in need of some serious practice, the guys head to Dennis' old fraternity house at the University of Pennsylvania to get their game up to speed while Dee hones her skills on her own. Frank wears skinny pants."
    },
    "S05E06": {
        "name": "The World Series Defense",
        "tvdb_id": 213104,
        "overview": "The gang describes the trials and tribulations they went through, during game five of the World Series, in hopes the judge will clear them of all the citations they received."
    },
    "S08E09": {
        "name": "The Gang Dines Out",
        "tvdb_id": 213139,
        "overview": "Every member of The Gang has something to celebrate at Guigino's, Philly's finest eatery, but when Mac and Dennis' private dinner is interrupted by an unexpected sighting of Frank and Charlie, the in-fighting begins. Dee also turns up at a table for one, and over the course of the night, the \"one-ups-manship\" soars to new heights."
    },
    "S01E05": {
        "name": "Gun Fever",
        "tvdb_id": 213048,
        "overview": "The guys buy a gun after the bar's safe is stolen."
    },
    "S04E09": {
        "name": "Dennis Reynolds: An Erotic Life",
        "tvdb_id": 213088,
        "overview": "After discovering Dennis' erotic memoir, Mac and Frank attempt to make some money off of it. Meanwhile, Dee and Charlie decide to spend a day in each other's shoes."
    },
    "S03E14": {
        "name": "Bums: Making a Mess All Over the City",
        "tvdb_id": 213078,
        "overview": "Mac and Dee become vigilantes in order to remove the homeless from their neighborhood, while Frank and Dennis impersonate police officers."
    },
    "S13E05": {
        "name": "The Gang Gets New Wheels",
        "tvdb_id": 1567911,
        "overview": "Dee gets in with a group of cool, rich housewives. Dennis hits it off with some everyday blue-collar bros. Frank struggles to renew his license, and Charlie and Mac deal with a new generation of bicycle bullies."
    },
    "S13E04": {
        "name": "Time's Up for the Gang",
        "tvdb_id": 1561526,
        "overview": "Paddy's has been put on a list of bars that are sexually hostile to women, and the gang must attend a sexual harassment seminar to get off the list."
    },
    "S13E10": {
        "name": "Mac Finds His Pride",
        "tvdb_id": 1585344,
        "overview": "Frank tries to recruit Mac for the gang’s kickass float for the Gay Pride Parade. It dawns on Frank that Mac will never be secure with his sexual identity unless he comes out to his father."
    },
    "S03E15": {
        "name": "The Gang Dances Their Asses Off",
        "tvdb_id": 213079,
        "overview": "In the season finale, Charlie accidentally puts Paddy's up as a prize for a dance marathon, which prompts the gang to enter the competition in order to save their bar."
    },
    "S03E01": {
        "name": "The Gang Finds a Dumpster Baby",
        "tvdb_id": 213066,
        "overview": "Dennis joins up with an environmentalist group, but his altruistic intentions quickly sour when he's snubbed by the activists. Dee and Mac decide to raise a baby they find in the dumpster, but quickly find out that it's not nearly as fun as they thought it would be, and Frank and Charlie take the concept of recycling a bit too far."
    },
    "S04E08": {
        "name": "Paddy’s Pub: The Worst Bar in Philadelphia",
        "tvdb_id": 213087,
        "overview": "A newspaper critic is kidnapped by the gang after he calls Paddy's pub the worst bar in Philadelphia."
    },
    "S01E04": {
        "name": "Charlie Has Cancer",
        "tvdb_id": 213049,
        "overview": "After discovering that he might have cancer, Mac and Dennis attempt to find a woman who will sleep with Charlie.  In the midst of their search, Mac falls in love with a transsexual he meets at the bar named Carmen.  Overwhelmed by the extra workload that she had to take on since Charlie has taken a leave of absence, Dee tries to get Dennis to hire a recently out of work actress friend to help out."
    },
    "S08E08": {
        "name": "Charlie Rules the World",
        "tvdb_id": 213140,
        "overview": "After slipping into an unhealthy obsession with computer games, The Gang wrestles to define the difference between the real and the virtual worlds."
    },
    "S11E01": {
        "name": "Chardee MacDennis 2: Electric Boogaloo",
        "tvdb_id": 1136858,
        "overview": "The gang agrees to a truce while demonstrating Chardee MacDennis for an interested board game executive, but the nature of the game quickly sends things off the rails"
    },
    "S11E03": {
        "name": "The Gang Hits the Slopes",
        "tvdb_id": 1155135,
        "overview": "Dennis and Frank square off against Dee and Mac for control of the mountain, while Charlie learns that the slopes have their own set of rules."
    },
    "S01E06": {
        "name": "The Gang Finds a Dead Guy",
        "tvdb_id": 213054,
        "overview": "Mac and Dennis befriend a patron found dead at their bar in order to win the affection of his granddaughter."
    },
    "S03E03": {
        "name": "Dennis and Dee's Mom Is Dead",
        "tvdb_id": 213068,
        "overview": "After Barbara's death, Dee and Frank are unhappy to learn that she left them both out of the will, while Dennis inherits the mansion which he plans to turn into a party pad."
    },
    "S13E06": {
        "name": "The Gang Solves the Bathroom Problem",
        "tvdb_id": 1585340,
        "overview": "Jimmy Buffett is in town and the positive vibes are alive at the bar. But when Mac comes out of the women's bathroom, no one can leave until the bathroom situation is solved."
    },
    "S13E07": {
        "name": "The Gang Does a Clip Show",
        "tvdb_id": 1585341,
        "overview": "With nothing to do while their phones update to the latest software, the gang decides to reminisce on old times. As everyone misremembers events from their past, the gang's current reality becomes altered."
    },
    "S03E02": {
        "name": "The Gang Gets Invincible",
        "tvdb_id": 213065,
        "overview": "Mac, Dennis and Dee try out for the Philadelphia Eagles.  Also interested in becoming an Eagle is Liam and Ryan McPoyle's brother, Doyle."
    },
    "S01E07": {
        "name": "Charlie Got Molested",
        "tvdb_id": 213051,
        "overview": "Charlie and Mac's old high school gym teacher is accused of molestation."
    },
    "S11E02": {
        "name": "Frank Falls Out the Window",
        "tvdb_id": 1155134,
        "overview": "Frank falls out the window causing him to think it's 2006, the gang approaches it as a do-over and attempts to fix their past mistakes."
    },
    "S11E06": {
        "name": "Being Frank",
        "tvdb_id": 1165127,
        "overview": "The gang have a new scheme and Frank tries to keep up."
    },
    "S01E03": {
        "name": "Underage Drinking: A National Concern",
        "tvdb_id": 213053,
        "overview": "After reminiscing about high school, the guys conclude that it would be a public service if they allowed teens to drink in the bar, thus providing a safe and controlled environment for teens to party. Feeling that she missed out on a lot as a teenager due to having to wear a brace for her scoliosis, Dee begins dating a high school jock."
    },
    "S03E12": {
        "name": "The Gang Gets Whacked (1)",
        "tvdb_id": 213076,
        "overview": "After stumbling upon a kilo of cocaine, the gang is forced to pay off a $25,000 debt to the mob. Mac becomes a mob informant, while Frank pimps out Dennis as an escort at the local country club. Charlie stumbles upon an opportunity to sell illegal narcotics."
    },
    "S03E06": {
        "name": "The Gang Solves the North Korea Situation",
        "tvdb_id": 213067,
        "overview": "A Korean restaurant owner threatens to get Paddy's kicked off the route for the city's annual pub crawl. The gang's response: War."
    },
    "S13E03": {
        "name": "The Gang Beats Boggs: Ladies Reboot",
        "tvdb_id": 1561525,
        "overview": "To one-up the guys, Dee has organized an \"all-female reboot\" of the Wade Boggs challenge on a first-of-its-kind, all-female flight headed to L.A. for the women's march."
    },
    "S13E02": {
        "name": "The Gang Escapes",
        "tvdb_id": 1561524,
        "overview": "To boost productivity, Dee hires an at-home \"Escape Room Experience\" service to come to Dennis and Mac's apartment. Will they escape? Who will get the credit? What could go wrong?"
    },
    "S03E07": {
        "name": "The Gang Sells Out",
        "tvdb_id": 213071,
        "overview": "The gang agrees to sell Paddys when they get an offer that is too good to refuse, but it forces the bar's non-partners, Dee and Charlie to find new jobs."
    },
    "S03E13": {
        "name": "The Gang Gets Whacked (2)",
        "tvdb_id": 213077,
        "overview": "While paying off their debt to the mob, Charlie and Dee try to find a way to make fake cocaine in order to fool them, while Dennis ranks in thousands of dollars being pimped out at the local country club. Mac realizes his position as a mob informant isn't being utilized to its full potential."
    },
    "S01E02": {
        "name": "Charlie Wants an Abortion",
        "tvdb_id": 213052,
        "overview": "A girl from Charlie's past reveals they have a child together.  Mac sees the benefits in being a pro-life advocate, while Dennis uses an abortion rally to meet women."
    },
    "S11E07": {
        "name": "McPoyle vs. Ponderosa: The Trial of the Century",
        "tvdb_id": 1166343,
        "overview": "Old grievances bubble to the surface when The Lawyer agrees to sue Bill Ponderosa on behalf of the Liam McPoyle and his lost eye."
    },
    "S11E05": {
        "name": "Mac & Dennis Move to the Suburbs",
        "tvdb_id": 1163169,
        "overview": "Mac and Dennis move to the suburbs for cheaper rent but find it hard to adjust."
    },
    "S06E09": {
        "name": "Dee Reynolds: Shaping America's Youth",
        "tvdb_id": 213110,
        "overview": "Motivated by the drama teacher who inspired her, Dee takes a job as a substitute teacher, and exposes her students to the culture of Paddy's with a field trip to see the Gang's take on the Lethal Weapon series: Lethal Weapon 5."
    },
    "S03E05": {
        "name": "The Aluminum Monster vs. Fatty Magoo",
        "tvdb_id": 213070,
        "overview": "Dee is shocked to learn that an overweight social outcast from her High School has become a rich and skinny fashion designer."
    },
    "S03E11": {
        "name": "Dennis Looks Like a Registered Sex Offender",
        "tvdb_id": 213075,
        "overview": "When Dennis is mistaken for a recently released child molester, he is more bothered by the fact that the guy is overweight rather than him being a sex offender.  Meanwhile, Mac tries once again to bond with his ex-con father, who shows an interest in Dee."
    },
    "S14E09": {
        "name": "A Woman's Right to Chop",
        "tvdb_id": 1989359,
        "overview": "When a trendy new hair salon opens up right next door to Paddy's, Dennis and Frank go on the offensive to stop women from cutting off their hair. Meanwhile, Mac is reunited with his childhood dog Poppins.."
    },
    "S14E08": {
        "name": "Paddy's Has a Jumper",
        "tvdb_id": 1980434,
        "overview": "Trapped inside Paddy's with a suicide jumper on the roof, the Gang wonders if they should bother intervening with an algorithm of their own - Could he, would he, should we? the second half hour, Dennis and Charlie stand guard at the entrance to their laser tag base waiting to ambush the legendary \"Big Mo,\" but Dennis begins to ponder the reasons they play laser tag and if their pursuit of a victory is worth their effort."
    },
    "S13E01": {
        "name": "The Gang Makes Paddy's Great Again",
        "tvdb_id": 1516514,
        "overview": "Meet Cindy, the new, ethnically diverse female member of the gang who can successfully pull off scams. Everything is working until Mac introduces a new member: a life-like sex doll that looks exactly like Dennis."
    },
    "S03E10": {
        "name": "Mac Is a Serial Killer",
        "tvdb_id": 213074,
        "overview": "After Mac arrives to the bar with scratches on his neck and exhibiting strange behavior, Frank comes to the conclusion that he is the serial killer terrorizing young women in Philadelphia. Frank sets out with his trusty chainsaw and a doubtful Charlie to find evidence to implicate Mac in the murders. In search of another suspect, Dennis and Dee do a little role-playing in order to help themselves better understand who they might be dealing with."
    },
    "S03E04": {
        "name": "The Gang Gets Held Hostage",
        "tvdb_id": 213069,
        "overview": "The McPoyles hold the entire gang hostage at Paddys while Frank is busy searching for his will in the air ducts."
    },
    "S01E01": {
        "name": "The Gang Gets Racist",
        "tvdb_id": 213050,
        "overview": "The guys hire Dee's friend, Terrell to promote the bar.  Meanwhile, Charlie tries to prove that he is not a racist."
    },
    "S06E08": {
        "name": "The Gang Gets a New Member",
        "tvdb_id": 213109,
        "overview": "A blast from the past prompts the guys to expand membership, and Dee to re-consider her future."
    },
    "S11E04": {
        "name": "Dee Made a Smut Film",
        "tvdb_id": 1155136,
        "overview": "Dennis and Dee film an adaptation of Dennis' erotic memoirs while Frank and Mac try to pass off Charlie as a gifted artist for financial gain."
    },
    "S11E10": {
        "name": "The Gang Goes to Hell (2)",
        "tvdb_id": 1166346,
        "overview": "The gang gets real with one another in the face of death."
    },
    "S11E09": {
        "name": "The Gang Goes to Hell (1)",
        "tvdb_id": 1166345,
        "overview": "The gang tries to take a vacation from their usual dynamic by going on a cruise, but old habits die hard."
    },
    "S06E11": {
        "name": "The Gang Gets Stranded in the Woods",
        "tvdb_id": 213112,
        "overview": "En route to Atlantic City for a charity event, Mac, Frank and Dee get lost. Meanwhile, Dennis and Charlie hitch a ride to town."
    },
    "S06E05": {
        "name": "Mac and Charlie: White Trash",
        "tvdb_id": 213108,
        "overview": "Rejected from a pool club, Mac and Charlie set out fix an abandoned pool to help cope with the Philly heat wave. Meanwhile, Dennis and Dee go about dealing with the heat in a different way."
    },
    "S03E09": {
        "name": "Sweet Dee's Dating a Retarded Person",
        "tvdb_id": 213073,
        "overview": "Dee gets involved with a famous local rapper who might be mentally challenged, and whose success inspires the rest of the gang to start a band."
    },
    "S14E05": {
        "name": "The Gang Texts",
        "tvdb_id": 1939279,
        "overview": "During their trip to the Philadelphia Zoo, Mac sets up a text group chain for The Gang, but confusion sets in and The Gang must learn from the meerkats on how to communicate properly in a group."
    },
    "S14E10": {
        "name": "Waiting for Big Mo",
        "tvdb_id": 1990176,
        "overview": "In this spoof of Waiting for Godot, Dennis and Charlie stand guard at their laser tag base waiting to ambush their enemy, Big Mo, but Dennis has doubts about why they play laser tag and whether or not the victory is worth it."
    },
    "S14E04": {
        "name": "The Gang Chokes",
        "tvdb_id": 1939278,
        "overview": "Annoyed that the Gang failed to react as he nearly choked to death on an appetizer, Frank decides the Waiter, his savior, is the only person who has his back."
    },
    "S04E01": {
        "name": "Mac and Dennis: Manhunters",
        "tvdb_id": 213080,
        "overview": "Charlie and Dee have been stealing Frank's delicious meats, so Frank leaves out human meat to get back at them. Driven by their cannibalistic needs, Charlie and Dee go in search of human flesh. Mac and Dennis harass Frank for hunting defenseless animals and think it would be much more badass to hunt something that could fight back ... like a human."
    },
    "S03E08": {
        "name": "Frank Sets Sweet Dee On Fire",
        "tvdb_id": 213072,
        "overview": "Mac teams up with Frank and Charlie to create a public access newscast after he misses his chance at fame in the news. Meanwhile, Dennis and Dee try to make it big in the club scene."
    },
    "S08E01": {
        "name": "Pop-Pop: The Final Solution",
        "tvdb_id": 213132,
        "overview": "Dennis and Dee's ailing grandfather Pop-Pop is wasting away in the hospital, and they have to decide whether or not to pull the plug. But things get complicated when The Gang learns of Pop-Pop's history as a Nazi, and Mac, Charlie and Frank set off in search of the old man's spoils from the war."
    },
    "S06E04": {
        "name": "Mac's Big Break",
        "tvdb_id": 213107,
        "overview": "Mac finally gets his big break after correctly answering a trivia question on the radio. While Frank, Dennis, and Dee take their bar-banter to the internet with their own podcast."
    },
    "S06E10": {
        "name": "Charlie Kelly: King of the Rats",
        "tvdb_id": 213111,
        "overview": "Keeping the basement rodent-free drives Charlie to the brink. The gang throws Charlie a surprise party."
    },
    "S11E08": {
        "name": "Charlie Catches a Leprechaun",
        "tvdb_id": 1166344,
        "overview": "Dennis tries to create an innovative mobile Paddy's pub experience but runs into trouble when customers refuse to cooperate, while Charlie and Mac attempt to catch a thieving leprechaun."
    },
    "S16E01": {
        "name": "The Gang Inflates",
        "tvdb_id": 4396105,
        "overview": "Dennis and Mac get into inflatable furniture to deal with the economy’s inflation, while Dee tries to find a place to crash after being evicted by her greedy landlord and Charlie wants to pitch Frank his crypto/online investment idea. And in this inflation episode everything gets bigger - Dee’s desperation, Mac’s lips, and even Charlie’s apartment!"
    },
    "S16E03": {
        "name": "The Gang Gets Cursed",
        "tvdb_id": 4433262,
        "overview": "The Gang’s going to be on Bar Rescue but a series of bad omens leads them to believe they are all cursed. They set off to undo the curses and make amends to those they’ve wronged, while Mac, who’s on a run of good luck, meets Chase Utley and invites him for a catch."
    },
    "S06E06": {
        "name": "Mac's Mom Burns Her House Down",
        "tvdb_id": 213115,
        "overview": "Mac's mother is left homeless after she burns down her house, which leaves Charlie and Mac with no choice but to make new living arrangements; when Dee feels under the weather, Frank tries to muster his paternal instincts to care for her."
    },
    "S06E12": {
        "name": "Dee Gives Birth",
        "tvdb_id": 213116,
        "overview": "Dee's blessed event is fast approaching but the father's identity remains a mystery---to the gang, at least. So they throw a party and invite all of Dee's former flings."
    },
    "S08E03": {
        "name": "The Maureen Ponderosa Wedding Massacre",
        "tvdb_id": 213134,
        "overview": "The gang make a disturbing discovery after crashing Maureen's wedding."
    },
    "S04E03": {
        "name": "America’s Next Top Paddy’s Billboard Model Contest",
        "tvdb_id": 213082,
        "overview": "Due to the gang's latest \"business expenses,\" Paddy's is in dire need of money. Frank buys a billboard to advertise the bar, but Dee decides to create a viral video to post on YouTube for promotion. Charlie quickly joins her, leaving Frank and Mac to hold a contest for some hot models to feature on the billboard. Naturally, Dennis joins the competition to prove his worth."
    },
    "S14E06": {
        "name": "The Janitor Always Mops Twice",
        "tvdb_id": 1939280,
        "overview": "In the black-and-white noir world of his memory, Charlie navigates the seedy underbelly of Philadelphia as Frank has been \"diarrhea poisoned,\" and it's up to Charlie to clean up the mess."
    },
    "S14E07": {
        "name": "The Gang Solves Global Warming",
        "tvdb_id": 1949935,
        "overview": "As a record-breaking heat wave overtakes Philly, the Gang plans to profit from global warming by pumping up the A/C so people will congregate at Paddy's and save energy at home."
    },
    "S04E02": {
        "name": "The Gang Solves the Gas Crisis",
        "tvdb_id": 213081,
        "overview": "Charlie, Mac, and Dennis formulate a plan to take advantage of the rising gas prices. By purchasing excess amounts now, they can sell it in the future and profit. As usual, things don't go as planned. Dee is also out to make money when she learns that Bruce is going to give the family fortune to a Muslim cultural center. She and Frank try to stop him and get the cash for themselves."
    },
    "S08E02": {
        "name": "The Gang Recycles Their Trash",
        "tvdb_id": 213133,
        "overview": "With the garbage men of Philadelphia on strike, Frank concocts a plan to undercut the union and get the contract to collect the city's trash."
    },
    "S06E13": {
        "name": "A Very Sunny Christmas",
        "tvdb_id": 213117,
        "overview": "After years of being mistreated by Frank during the holiday season, Dennis and Dee decide to teach him a lesson. Meanwhile, Mac and Charlie reflect on their childhood Christmases, and realize that they were not as joyous and wonderful as they remembered."
    },
    "S06E07": {
        "name": "Who Got Dee Pregnant",
        "tvdb_id": 213113,
        "overview": "The gang gets a real scare after Dee reveals she's pregnant, forcing the guys to recall their last hazy Halloween party to determine who the father is."
    },
    "S16E02": {
        "name": "Frank Shoots Every Member of the Gang",
        "tvdb_id": 4429140,
        "overview": "After Frank shoots Dennis and Dee, they resolve to take Frank’s gun away. Mac and Charlie go on a road trip with their moms to get their inheritances -- for Mac, it’s letters written by his grandfather which have fallen into his Uncle Donald’s hands, while for Charlie, it’s a jar of teeth that is now in the hands of his sisters, Bunny and Candy."
    },
    "S16E06": {
        "name": "Risk E. Rat's Pizza and Amusement Center",
        "tvdb_id": 4449750,
        "overview": "The gang goes to Risk E. Rat's, finding it updated with safety and overcautiousness. Dee takes Frank on a scavenger hunt to find risqué jokes hidden throughout the establishment. Mac plays Skee-Ball to win tickets for a prize."
    },
    "S08E06": {
        "name": "Charlie's Mom Has Cancer",
        "tvdb_id": 213136,
        "overview": "Mac, Charlie and Dee struggle with their faith as Charlie's mom fights cancer. Meanwhile, Frank loses his memory amidst a search for buried treasure."
    },
    "S06E03": {
        "name": "The Gang Buys a Boat",
        "tvdb_id": 213114,
        "overview": "The gang attempts to find adventure on the sea after they purchase their 'new' boat."
    },
    "S04E06": {
        "name": "Mac and Charlie Die (2)",
        "tvdb_id": 213085,
        "overview": "Part 2 of 2. Dennis, Frank, and Dee find unique ways of coping with the apparent loss of their friends."
    },
    "S04E12": {
        "name": "The Gang Gets Extreme: Home Makeover Edition",
        "tvdb_id": 213091,
        "overview": "Hoping to make their own dreams come true, the gang sets out to give an unexpected family an extreme home makeover."
    },
    "S14E03": {
        "name": "Dee Day",
        "tvdb_id": 1930959,
        "overview": "The Guys are in the final preparation stage for an unknown scheme when Dee excitedly enters to inform them that today is “Dee Day.” The guys have to do everything she wants without complaint."
    },
    "S14E02": {
        "name": "Thunder Gun 4: Maximum Cool",
        "tvdb_id": 1930958,
        "overview": "The Gang finds themselves in the middle of a focus group after a screening of Thunder Gun 4: Maximum Cool. They are determined to restore glory and traditional American values back into the franchise, even if it involves sabotage."
    },
    "S04E13": {
        "name": "The Nightman Cometh",
        "tvdb_id": 213092,
        "overview": "In the season finale, Charlie gets the gang to help him put together a rock opera based on his song \"Nightman.\""
    },
    "S04E07": {
        "name": "Who Pooped the Bed?",
        "tvdb_id": 213086,
        "overview": "Charlie and Frank awake to find poop in their bed. Neither will confess to being the owner, so they, Mac, and Dennis try to scientifically deduce who dropped the deuce. Dee wants to do something a bit more sophisticated, so she invites the waitress and Artemis to a girls' night out."
    },
    "S06E02": {
        "name": "Dennis Gets Divorced",
        "tvdb_id": 213106,
        "overview": "Marital bliss turns into business, as the gang experiences the emotional and economic hardships of divorce."
    },
    "S08E07": {
        "name": "Frank's Back in Business",
        "tvdb_id": 213138,
        "overview": "With Charlie under his wing, Frank cleans up so he can get his hands dirty and help out his old company with one last big merger. An unwritten rule of the bar gets the rest of the gang caught up in a case of mistaken identity."
    },
    "S16E05": {
        "name": "Celebrity Booze: The Ultimate Cash Grab",
        "tvdb_id": 4433264,
        "overview": "When news spreads of Bryan Cranston and Aaron Paul’s visit to Philadelphia to promote their Dos Hermanos mezcal brand, the Guys decide to pitch them their own liquor. The Gang takes to the skies to get a taste of the glamorous high life."
    },
    "S08E05": {
        "name": "The Gang Gets Analyzed",
        "tvdb_id": 213142,
        "overview": "The Gang gets Freudian as they step into the therapist's office to work through their mountain of issues, but when Dennis thinks he has everyone figured out, the shrink turns the tables on him and exposes the insanity in his unique brand of pop psychology."
    },
    "S04E11": {
        "name": "The Gang Cracks the Liberty Bell",
        "tvdb_id": 213090,
        "overview": "The gang fudge history by claiming that Paddy's Pub was responsible for cracking the Liberty Bell in an attempt to turn their dive into a Philadelphia landmark."
    },
    "S04E05": {
        "name": "Mac and Charlie Die (1)",
        "tvdb_id": 213084,
        "overview": "Part 1 of 2. Mac and Charlie fake their deaths to avoid the wrath of Mac's father who was released from prison and is out for vengeance."
    },
    "S13E09": {
        "name": "The Gang Wins the Big Game",
        "tvdb_id": 1585343,
        "overview": "It’s the most important weekend of their lives and Frank has treated the gang and a crew of their ragtag hangers-on with tickets to see the Eagles in the Super Bowl!"
    },
    "S13E08": {
        "name": "Charlie's Home Alone",
        "tvdb_id": 1585342,
        "overview": "It's the weekend of Super Bowl LII from Charlie's perspective. While Charlie searches the back office, Cricket steals the suit leaving Charlie home alone to defend himself."
    },
    "S14E01": {
        "name": "The Gang Gets Romantic",
        "tvdb_id": 1835648,
        "overview": "Mac concocts a scheme to attract single women to Airbnb Dennis' bedroom, while Frank and Charlie concoct similar plans to attract young, European coeds. But neither ad attracts their intended target."
    },
    "S04E04": {
        "name": "Mac’s Banging the Waitress",
        "tvdb_id": 213083,
        "overview": "Charlie finds out that the waitress has been seeing someone. He calls on Mac, his so-called best friend, to find out more information about the guy and to beat him up. However, it turns out that Mac is the guy the waitress has supposedly been seeing. Dennis, heartbroken that he's not Charlie's best friend, tries to win him over."
    },
    "S04E10": {
        "name": "Sweet Dee Has a Heart Attack",
        "tvdb_id": 213089,
        "overview": "After Dee suffers a heart attack, she and Dennis try to live a healthier lifestyle. Meanwhile, Charlie and Mac take corporate jobs to get health insurance."
    },
    "S06E01": {
        "name": "Mac Fights Gay Marriage",
        "tvdb_id": 213105,
        "overview": "Mac defends traditional marriage, while the rest of the gang reaps the rewards of wedded bliss."
    },
    "S08E10": {
        "name": "Reynolds vs. Reynolds: The Cereal Defense",
        "tvdb_id": 213141,
        "overview": "Court is in session at Paddy's Pub as Frank and Dennis present their cases to the rest of the gang, resulting in a verdict that will change their lives FOREVER... but not really."
    },
    "S08E04": {
        "name": "Charlie and Dee Find Love",
        "tvdb_id": 213137,
        "overview": "Charlie and Dee become romantically involved with two members of a wealthy family, which arouses jealousy in Mac, Dennis and Frank."
    },
    "S16E04": {
        "name": "Frank vs. Russia",
        "tvdb_id": 4433263,
        "overview": "Charlie cheers on Frank at a local chess tournament against a Russian grandmaster. Dennis helps Mac and Dee find boyfriends after getting irritated by Mac’s current boyfriend, Johnny."
    },
    "S02E02": {
        "name": "The Gang Goes Jihad",
        "tvdb_id": 213064,
        "overview": "When the gang learns that they are in danger of losing their bar due to a zoning mishap, they resort to some outlandish and extreme methods to prevent that from happening. Meanwhile, Frank isn’t too happy when his wife returns to town."
    },
    "S12E07": {
        "name": "PTSDee",
        "tvdb_id": 1260573,
        "overview": "Dee dates a male stripper and tries to prove her worth after learning she's his \"rock bottom.\" Elsewhere: Mac and Frank get sucked into a VR war game, leading Mac to develop a case PTSD."
    },
    "S10E02": {
        "name": "The Gang Group Dates",
        "tvdb_id": 1036245,
        "overview": "The gang gets into the online dating scene to expand their matchmaking potential."
    },
    "S10E03": {
        "name": "Psycho Pete Returns",
        "tvdb_id": 1036246,
        "overview": "When Psycho Pete, long lost member of the freight train, is released from the mental hospital, Dennis and Dee rush to get him recommitted while Charlie and Mac attempt to restore him to his former hard-partying form."
    },
    "S12E06": {
        "name": "Hero or Hate Crime?",
        "tvdb_id": 1260572,
        "overview": "The gang fight over a lottery ticket and seek out an arbitrator to decide a rightful owner, who also decides if Frank is a hero or hate monger."
    },
    "S02E03": {
        "name": "Dennis and Dee Go on Welfare",
        "tvdb_id": 213056,
        "overview": "After quitting their job due to Frank's continuing interference, Dennis and Dee decide to seek alternative income by going on welfare. Meanwhile, Mac and Charlie must now bear the consequences of their friends’ departures from the business."
    },
    "S02E01": {
        "name": "Charlie Gets Crippled",
        "tvdb_id": 213060,
        "overview": "An accident that puts Charlie in a wheelchair opens up a window of possibilities for the gang. Meanwhile, Dennis and Dee’s estranged father reenters their life in hopes of starting anew with his children and soon discovers that he enjoys the lifestyle of their friends."
    },
    "S05E08": {
        "name": "Paddy's Pub: Home of the Original Kitten Mittens",
        "tvdb_id": 213096,
        "overview": "The gang decides to expand their business by developing a number of products that they could sell at Paddy's pub."
    },
    "S12E10": {
        "name": "Dennis' Double Life",
        "tvdb_id": 1279284,
        "overview": "Dennis reveals he has a baby after his Wade Boggs layover in North Dakota and the gang try to help him get out of the jam, but their suggestions border on the extreme."
    },
    "S12E04": {
        "name": "Wolf Cola: A Public Relations Nightmare",
        "tvdb_id": 1251895,
        "overview": "Franks Fluids LLC is in big trouble after a news segment. Dee and Dennis help with the PR nightmare and Charlie and Mac work on a scheme to make Fight Milk the official drink of the UFC."
    },
    "S10E01": {
        "name": "The Gang Beats Boggs",
        "tvdb_id": 1035952,
        "overview": "Mac oversees the gang while they compete to break Wade Boggs’ legendary beer drinking record."
    },
    "S09E08": {
        "name": "Flowers for Charlie",
        "tvdb_id": 968373,
        "overview": "When an experiment successfully multiplies Charlie's intellect and takes him away from the bar, the rest of the gang find themselves struggling to complete the menial \"Charlie Work\" that has kept the bar running for so long."
    },
    "S09E09": {
        "name": "The Gang Makes Lethal Weapon 6",
        "tvdb_id": 968374,
        "overview": "After creative differences over what constitutes tasteful nudity cause Frank to pull his money out of \"Lethal Weapon 6\" during filming, Mac, Dennis, and Charlie screen their rough footage for investors in hopes of raising enough capital to finish the production of their latest masterpiece."
    },
    "S12E05": {
        "name": "Making Dennis Reynolds a Murderer",
        "tvdb_id": 1260571,
        "overview": "A cat-woman is killed and Dennis becomes the main suspect."
    },
    "S05E09": {
        "name": "Mac and Dennis Break Up",
        "tvdb_id": 213102,
        "overview": "Mac and Dennis decide that they need to spend some time away from each other. Meanwhile, Charlie helps Dee search for her cat."
    },
    "S02E04": {
        "name": "Mac Bangs Dennis' Mom",
        "tvdb_id": 213063,
        "overview": "Barbara hooks up with Mac to make Frank jealous, which leads to retaliation from Dennis."
    },
    "S02E10": {
        "name": "Dennis and Dee Get a New Dad",
        "tvdb_id": 213059,
        "overview": "Dee receives e-mails from a stranger claiming to be her and Dennis' real father. Meanwhile, Mac decides to visit his father who is in prison."
    },
    "S15E08": {
        "name": "The Gang Carries a Corpse Up a Mountain",
        "tvdb_id": 3331823,
        "overview": "The Gang attempts to ascend a mountain in order for Charlie to fulfill an old and mysterious Irish burial tradition. One by one, the Gang backs out until Charlie is left to honor the dead body alone."
    },
    "S12E01": {
        "name": "The Gang Turns Black",
        "tvdb_id": 1250993,
        "overview": "After an electric heating blanket shorts out while the gang watches the Wiz they look in the mirror and realize they've turned black. They have to figure out how to get back to being themselves by going through all the classic body switch movie shenanigans they encounter."
    },
    "S10E10": {
        "name": "Ass Kickers United: Mac and Charlie Join a Cult",
        "tvdb_id": 1043089,
        "overview": "\"Asskickers\" isn't just a hot new way to work out; it's a way of life...and maybe a cult."
    },
    "S10E04": {
        "name": "Charlie Work",
        "tvdb_id": 1038891,
        "overview": "Charlie goes into overdrive when he's notified that the health inspector will be arriving that day. Meanwhile, the rest of the gang is trying to exploit a flaw in the air-miles reward system. Written by David Hornsby; directed by Matt Shakman."
    },
    "S07E08": {
        "name": "The ANTI-Social Network",
        "tvdb_id": 213125,
        "overview": "The gang uses the Internet to cyber-stalk their prey. Frank tries to drum up business for Paddy's with a viral video."
    },
    "S07E09": {
        "name": "The Gang Gets Trapped",
        "tvdb_id": 213127,
        "overview": "The Gang's plan to \"extract\" an \"artifact\" from a residence is jeopardized when the owners turn out to be home. Having not been noticed on the way in, they must make a plan to get the same result for the way out."
    },
    "S10E05": {
        "name": "The Gang Spies Like U.S.",
        "tvdb_id": 1036421,
        "overview": "Dennis and Mac enlist Dee to spy on the fish factory across the street, Charlie and Frank grow suspicious and decide to do some spying of their own. Written by David Hornsby; directed by Matt Shakman."
    },
    "S02E05": {
        "name": "Hundred Dollar Baby",
        "tvdb_id": 213058,
        "overview": "Frank runs into an old adversary at the gym when he begins teaching Dee to box after she was robbed. Hoping to make some extra money on the side, Mac and Dennis make preparations for Charlie to compete in an underground street fighting match."
    },
    "S02E07": {
        "name": "The Gang Exploits A Miracle",
        "tvdb_id": 213062,
        "overview": "Mac and Dee become uncomfortable when the rest of the guys decide to make some extra money by exploiting the similarities between a water stain and the Virgin Mary. A reunion with someone from the past, stirs up forbidden feelings within Dee."
    },
    "S12E02": {
        "name": "The Gang Goes to a Water Park",
        "tvdb_id": 1251892,
        "overview": "The gang takes a trip to a local waterpark. Dennis takes on a protégé. Frank and Charlie are determined to ride every ride. Mac and Dee get stuck in a tube slide."
    },
    "S10E07": {
        "name": "Mac Kills His Dad",
        "tvdb_id": 1039071,
        "overview": "News surfaces about Mac's Dad, Luther, being a murder suspect. Mac goes into full \"P.I.\" mode to clear his father of any wrong doing."
    },
    "S10E06": {
        "name": "The Gang Misses the Boat",
        "tvdb_id": 1041747,
        "overview": "The group separates from one another to find out who they are as individuals after another failed endeavor."
    },
    "S12E03": {
        "name": "Old Lady House: A Situation Comedy",
        "tvdb_id": 1251893,
        "overview": "Charlie thinks Mac's mom is holding his mom hostage so the gang installs spy cameras in their house. They discover the moms are quite entertaining once Dennis makes edits to the footage."
    },
    "S02E06": {
        "name": "The Gang Gives Back",
        "tvdb_id": 213055,
        "overview": "After being arrested for arson the gang is sentenced to do community service. Frank makes an effort to connect more with Dennis. Meanwhile, Charlie is also ordered to attend AA where he makes a startling discovery that might be beneficial in his ongoing quest to hook up with the Waitress."
    },
    "S16E078": {
        "name": "Dennis Takes a Mental Health Day",
        "tvdb_id": 9794770,
        "overview": "After a physical reveals that Dennis has elevated blood pressure, he decides to take a day away from The Gang to de-stress at the beach. But life has other plans, and his day spirals into a domino-chain of tech and customer service challenges until he can no longer contain his rage."
    },
    "S16E07": {
        "name": "The Gang Goes Bowling",
        "tvdb_id": 9794771,
        "overview": "The guys crash Dee's bowling league night and compete in a Battle of the Sexes at a bowling alley owned by the McPoyles. Dee, The Waitress, Artemis, and Gail the Snail versus Dennis, Mac, Charlie, and Frank in a classic match to prove once and for all who has the upper hand in sports."
    }
}
