{"S02E08": {"name": "Man City", "tvdb_id": 3179056, "overview": "Ted and Dr. Sharon realize they might have to meet each other halfway. Tensions are high as the team prepares for the semifinal."}, "S02E09": {"name": "Beard After Hours", "tvdb_id": 3205724, "overview": "After the semifinal, Beard sets out on an all-night odyssey through London in an effort to collect his thoughts."}, "S01E05": {"name": "Tan Lines", "tvdb_id": 2397461, "overview": "With his wife and son visiting from America, Ted makes drastic changes to the lineup during a critical match."}, "S03E01": {"name": "Smells Like Mean Spirit", "tvdb_id": 4234077, "overview": "The newly promoted AFC Richmond face mockery as pundits predict they’ll finish dead last this season."}, "S01E10": {"name": "The Hope That Kills You", "tvdb_id": 2440612, "overview": "Richmond plays a climactic match that will determine the fates of Ted and his club."}, "S01E04": {"name": "For the Children", "tvdb_id": 2350786, "overview": "Rebecca hosts the team’s annual charity benefit, where Ted stages a reconciliation between Roy and Jamie."}, "S01E06": {"name": "Two Aces", "tvdb_id": 2405194, "overview": "When Jamie refuses to train, Ted turns to talented new signing Dani Rojas—and the team is struck by an age-old curse."}, "S03E03": {"name": "4-5-1", "tvdb_id": 4234079, "overview": "Richmond adjust to an exciting change, but Jamie has reservations. Ted learns there’s something new going on back in Kansas as well."}, "S03E02": {"name": "(I Don't Want to Go to) Chelsea", "tvdb_id": 4234078, "overview": "News of a top player looking to move to London sends the English clubs into a frenzy. Richmond play their first game back in the Premier League."}, "S01E07": {"name": "Make Rebecca Great Again", "tvdb_id": 2413910, "overview": "Rebecca celebrates her first anniversary as a divorcée as the team plays a match in Liverpool."}, "S01E03": {"name": "Trent Crimm: The Independent", "tvdb_id": 2350783, "overview": "To arrange an in-depth exposé, Rebecca pairs cynical journalist Trent Crimm with Ted for a day. Ted and Roy venture into the community."}, "S03E12": {"name": "So Long, Farewell", "tvdb_id": 4234091, "overview": "AFC Richmond play their final game of the season."}, "S03E06": {"name": "Sunflowers", "tvdb_id": 4234082, "overview": "A friendly match takes the team to Amsterdam, where one night out unlocks truths for many."}, "S03E07": {"name": "The Strings That Bind Us", "tvdb_id": 4234084, "overview": "The Greyhounds try a new strategy that has everyone thinking outside the box. Sam prepares to host a VIP guest at Ola’s."}, "S01E02": {"name": "Biscuits", "tvdb_id": 2350781, "overview": "It’s Ted’s first day of coaching, and fans aren’t happy. He makes little headway but remains undeterred as the team plays its first match."}, "S03E05": {"name": "Signs", "tvdb_id": 4234081, "overview": "With their season in a tailspin, Richmond try to right the ship against mighty Manchester City. Off the pitch, everyone faces their own setbacks."}, "S03E11": {"name": "Mom City", "tvdb_id": 4234090, "overview": "An unexpected guest has Ted on edge. When Richmond travel to Manchester for a big match, Roy and Keeley become concerned about Jamie."}, "S03E10": {"name": "International Break", "tvdb_id": 4234088, "overview": "While some of the Greyhounds head home to play for their countries in international matches, Edwin Akufo brings a business proposal to Rebecca."}, "S03E04": {"name": "Big Week", "tvdb_id": 4234080, "overview": "Everyone’s feeling the pressure as Richmond gear up to play West Ham. Ted is reunited with an old friend."}, "S01E01": {"name": "Pilot", "tvdb_id": 2043514, "overview": "American football coach Ted Lasso is hired by a wealthy divorcée to coach the English soccer team AFC Richmond."}, "S03E09": {"name": "La Locker Room Aux Folles", "tvdb_id": 4234087, "overview": "Colin and Isaac’s friendship is tested. Roy is asked to do a press conference."}, "S03E08": {"name": "We'll Never Have Paris", "tvdb_id": 4234085, "overview": "While watching Henry, Ted fights the urge to spiral when Michelle and Dr. Jacob go on a romantic trip. An online leak has massive implications for Keeley."}, "S01E09": {"name": "All Apologies", "tvdb_id": 2431342, "overview": "After a series of mistakes on the pitch, pressure mounts to bench Roy. Rebecca finally reveals the truth to Ted."}, "S01E08": {"name": "The Diamond Dogs", "tvdb_id": 2423205, "overview": "Ted and Roy are both having relationship problems. Ted consults the Diamond Dogs while Roy lays it on the line with Keeley."}, "S02E02": {"name": "Lavender", "tvdb_id": 3037725, "overview": "Ted is surprised by the reappearance of a familiar face. Roy tries out a new gig."}, "S02E03": {"name": "Do the Right-est Thing", "tvdb_id": 3037726, "overview": "Rebecca has a special visitor shadow her at work. A player’s return is not welcomed by the team."}, "S02E01": {"name": "Goodbye Earl", "tvdb_id": 2891253, "overview": "AFC Richmond brings in a sports psychologist to help the team overcome their unprecedented seven game tie-streak."}, "S02E04": {"name": "Carol of the Bells", "tvdb_id": 3089818, "overview": "It’s Christmas in Richmond. Rebecca enlists Ted for a secret mission, Roy and Keeley search for a miracle, and the Higginses open up their home."}, "S02E10": {"name": "No Weddings and a Funeral", "tvdb_id": 3222407, "overview": "Rebecca is stunned by a sudden loss. The team rallies to show their support, but Ted finds himself grappling with a piece of his past."}, "S02E11": {"name": "Midnight Train to Royston", "tvdb_id": 3222408, "overview": "A billionaire football enthusiast from Ghana makes Sam an unbelievable offer. Ted plans something special for Dr. Sharon’s last day with the team."}, "S02E05": {"name": "Rainbow", "tvdb_id": 3125400, "overview": "Nate learns how to be assertive from Keeley and Rebecca. Ted asks Roy for a favor."}, "S02E07": {"name": "Headspace", "tvdb_id": 3144061, "overview": "With things turning around for Richmond, it’s time for everyone to work on their issues—like Ted’s discomfort, Nate’s confidence, and Roy’s attention."}, "S02E06": {"name": "The Signal", "tvdb_id": 3125557, "overview": "Ted is fired up that the new team dynamic seems to be working. But will they have a chance in the quarterfinal?"}, "S02E12": {"name": "Inverting the Pyramid of Success", "tvdb_id": 3222409, "overview": "Richmond gets their final chance to win promotion as Ted deals with the fallout of Trent Crimm’s painfully honest exposé. Season finale."}}